#![allow(non_camel_case_types)]
#![allow(non_upper_case_globals)]
pub const _SYS_TYPES_H: ::std::os::raw::c_uint = 1;
pub const _FEATURES_H: ::std::os::raw::c_uint = 1;
pub const _DEFAULT_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC11: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC99: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC95: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX_IMPLICITLY: ::std::os::raw::c_uint = 1;
pub const _POSIX_SOURCE: ::std::os::raw::c_uint = 1;
pub const _POSIX_C_SOURCE: ::std::os::raw::c_uint = 200809;
pub const __USE_POSIX: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX2: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199309: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199506: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K8: ::std::os::raw::c_uint = 1;
pub const _ATFILE_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_MISC: ::std::os::raw::c_uint = 1;
pub const __USE_ATFILE: ::std::os::raw::c_uint = 1;
pub const __USE_FORTIFY_LEVEL: ::std::os::raw::c_uint = 0;
pub const _STDC_PREDEF_H: ::std::os::raw::c_uint = 1;
pub const __STDC_IEC_559__: ::std::os::raw::c_uint = 1;
pub const __STDC_IEC_559_COMPLEX__: ::std::os::raw::c_uint = 1;
pub const __STDC_ISO_10646__: ::std::os::raw::c_uint = 201605;
pub const __STDC_NO_THREADS__: ::std::os::raw::c_uint = 1;
pub const __GNU_LIBRARY__: ::std::os::raw::c_uint = 6;
pub const __GLIBC__: ::std::os::raw::c_uint = 2;

pub const XCB_CREATE_CURSOR: ::std::os::raw::c_uint = 93;
pub const XCB_CREATE_GLYPH_CURSOR: ::std::os::raw::c_uint = 94;
pub const XCB_FREE_CURSOR: ::std::os::raw::c_uint = 95;
pub const XCB_RECOLOR_CURSOR: ::std::os::raw::c_uint = 96;
pub const XCB_QUERY_BEST_SIZE: ::std::os::raw::c_uint = 97;
pub const XCB_QUERY_EXTENSION: ::std::os::raw::c_uint = 98;
pub const XCB_LIST_EXTENSIONS: ::std::os::raw::c_uint = 99;
pub const XCB_CHANGE_KEYBOARD_MAPPING: ::std::os::raw::c_uint = 100;
pub const XCB_GET_KEYBOARD_MAPPING: ::std::os::raw::c_uint = 101;
pub const XCB_CHANGE_KEYBOARD_CONTROL: ::std::os::raw::c_uint = 102;
pub const XCB_GET_KEYBOARD_CONTROL: ::std::os::raw::c_uint = 103;
pub const XCB_BELL: ::std::os::raw::c_uint = 104;
pub const XCB_CHANGE_POINTER_CONTROL: ::std::os::raw::c_uint = 105;
pub const XCB_GET_POINTER_CONTROL: ::std::os::raw::c_uint = 106;
pub const XCB_SET_SCREEN_SAVER: ::std::os::raw::c_uint = 107;
pub const XCB_GET_SCREEN_SAVER: ::std::os::raw::c_uint = 108;
pub const XCB_CHANGE_HOSTS: ::std::os::raw::c_uint = 109;
pub const XCB_LIST_HOSTS: ::std::os::raw::c_uint = 110;
pub const XCB_SET_ACCESS_CONTROL: ::std::os::raw::c_uint = 111;
pub const XCB_SET_CLOSE_DOWN_MODE: ::std::os::raw::c_uint = 112;
pub const XCB_KILL_CLIENT: ::std::os::raw::c_uint = 113;
pub const XCB_ROTATE_PROPERTIES: ::std::os::raw::c_uint = 114;
pub const XCB_FORCE_SCREEN_SAVER: ::std::os::raw::c_uint = 115;
pub const XCB_SET_POINTER_MAPPING: ::std::os::raw::c_uint = 116;
pub const XCB_GET_POINTER_MAPPING: ::std::os::raw::c_uint = 117;
pub const XCB_SET_MODIFIER_MAPPING: ::std::os::raw::c_uint = 118;
pub const XCB_GET_MODIFIER_MAPPING: ::std::os::raw::c_uint = 119;
pub const XCB_NO_OPERATION: ::std::os::raw::c_uint = 127;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_char;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(::std::mem::size_of::<__fsid_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __fsid_t ) ));
    assert_eq! (::std::mem::align_of::<__fsid_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __fsid_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __fsid_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __fsid_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __fsid_t {
    fn clone(&self) -> Self { *self }
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type time_t = __time_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulong;
pub type register_t = ::std::os::raw::c_long;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(::std::mem::size_of::<__sigset_t>() , 128usize , concat ! (
               "Size of: " , stringify ! ( __sigset_t ) ));
    assert_eq! (::std::mem::align_of::<__sigset_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( __sigset_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __sigset_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __sigset_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __sigset_t {
    fn clone(&self) -> Self { *self }
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(::std::mem::size_of::<timespec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timespec ) ));
    assert_eq! (::std::mem::align_of::<timespec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timespec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_nsec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_nsec ) ));
}
impl Clone for timespec {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(::std::mem::size_of::<timeval>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timeval ) ));
    assert_eq! (::std::mem::align_of::<timeval>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timeval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_usec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_usec ) ));
}
impl Clone for timeval {
    fn clone(&self) -> Self { *self }
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(::std::mem::size_of::<fd_set>() , 128usize , concat ! (
               "Size of: " , stringify ! ( fd_set ) ));
    assert_eq! (::std::mem::align_of::<fd_set>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( fd_set ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fd_set ) ) . __fds_bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( fd_set ) , "::" ,
                stringify ! ( __fds_bits ) ));
}
impl Clone for fd_set {
    fn clone(&self) -> Self { *self }
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                  __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                  __timeout: *mut timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                   __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                   __timeout: *const timespec, __sigmask: *const __sigset_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gnu_dev_major(__dev: ::std::os::raw::c_ulonglong)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: ::std::os::raw::c_ulonglong)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(__major: ::std::os::raw::c_uint,
                           __minor: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_ulonglong;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type pthread_t = ::std::os::raw::c_ulong;
// #[repr(C)]
// pub union pthread_attr_t {
//     pub __size: [::std::os::raw::c_char; 56usize],
//     pub __align: ::std::os::raw::c_long,
// }
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(::std::mem::size_of::<pthread_attr_t>() , 56usize , concat ! (
               "Size of: " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_attr_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __align ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(::std::mem::size_of::<__pthread_internal_list>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (::std::mem::align_of::<__pthread_internal_list>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __prev as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __prev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __next as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __next ) ));
}
impl Clone for __pthread_internal_list {
    fn clone(&self) -> Self { *self }
}
pub type __pthread_list_t = __pthread_internal_list;
// #[repr(C)]
// pub union pthread_mutex_t {
//     pub __data: pthread_mutex_t___pthread_mutex_s,
//     pub __size: [::std::os::raw::c_char; 40usize],
//     pub __align: ::std::os::raw::c_long,
// }
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_mutex_t___pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t___pthread_mutex_s() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t___pthread_mutex_s>() ,
               40usize , concat ! (
               "Size of: " , stringify ! ( pthread_mutex_t___pthread_mutex_s )
               ));
    assert_eq! (::std::mem::align_of::<pthread_mutex_t___pthread_mutex_s>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __lock as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __count as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __owner as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __owner ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __nusers as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __nusers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __kind as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __kind ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __spins as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __spins ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __elision as * const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __elision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __list as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __list ) ));
}
impl Clone for pthread_mutex_t___pthread_mutex_s {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t>() , 40usize , concat ! (
               "Size of: " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutex_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __align ) ));
}
// #[repr(C)]
// #[derive(Copy)]
// pub union pthread_mutexattr_t {
//     pub __size: [::std::os::raw::c_char; 4usize],
//     pub __align: ::std::os::raw::c_int,
// }
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutexattr_t>() , 4usize , concat
               ! ( "Size of: " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutexattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
// impl Clone for pthread_mutexattr_t {
//     fn clone(&self) -> Self { *self }
// }
// #[repr(C)]
// pub union pthread_cond_t {
//     pub __data: pthread_cond_t__bindgen_ty_1,
//     pub __size: [::std::os::raw::c_char; 48usize],
//     pub __align: ::std::os::raw::c_longlong,
// }
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_cond_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __futex: ::std::os::raw::c_uint,
    pub __total_seq: ::std::os::raw::c_ulonglong,
    pub __wakeup_seq: ::std::os::raw::c_ulonglong,
    pub __woken_seq: ::std::os::raw::c_ulonglong,
    pub __mutex: *mut ::std::os::raw::c_void,
    pub __nwaiters: ::std::os::raw::c_uint,
    pub __broadcast_seq: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t__bindgen_ty_1>() , 48usize
               , concat ! (
               "Size of: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_cond_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) . __lock
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __lock )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __futex as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __futex
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __total_seq as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __total_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __wakeup_seq as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __wakeup_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __woken_seq as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __woken_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __mutex as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __mutex
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __nwaiters as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nwaiters ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __broadcast_seq as * const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __broadcast_seq ) ));
}
impl Clone for pthread_cond_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t>() , 48usize , concat ! (
               "Size of: " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __align ) ));
}
// #[repr(C)]
// #[derive(Copy)]
// pub union pthread_condattr_t {
//     pub __size: [::std::os::raw::c_char; 4usize],
//     pub __align: ::std::os::raw::c_int,
// }
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_condattr_t>() , 4usize , concat !
               ( "Size of: " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_condattr_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
// impl Clone for pthread_condattr_t {
//     fn clone(&self) -> Self { *self }
// }
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
// #[repr(C)]
// pub union pthread_rwlock_t {
//     pub __data: pthread_rwlock_t__bindgen_ty_1,
//     pub __size: [::std::os::raw::c_char; 56usize],
//     pub __align: ::std::os::raw::c_long,
// }
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_rwlock_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __nr_readers: ::std::os::raw::c_uint,
    pub __readers_wakeup: ::std::os::raw::c_uint,
    pub __writer_wakeup: ::std::os::raw::c_uint,
    pub __nr_readers_queued: ::std::os::raw::c_uint,
    pub __nr_writers_queued: ::std::os::raw::c_uint,
    pub __writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_char,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t__bindgen_ty_1>() ,
               56usize , concat ! (
               "Size of: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<pthread_rwlock_t__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_rwlock_t__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __lock as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __lock
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_readers as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_readers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __readers_wakeup as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __readers_wakeup ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __writer_wakeup as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __writer_wakeup ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_readers_queued as * const _ as usize } , 16usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_readers_queued ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_writers_queued as * const _ as usize } , 20usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_writers_queued ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __writer as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __writer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __shared as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __shared ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __rwelision as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __rwelision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad1 as * const _ as usize } , 33usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad2 as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad2
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __flags as * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __flags ) ));
}
impl Clone for pthread_rwlock_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t>() , 56usize , concat !
               ( "Size of: " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlock_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __data as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __align ) ));
}
// #[repr(C)]
// #[derive(Copy)]
// pub union pthread_rwlockattr_t {
//     pub __size: [::std::os::raw::c_char; 8usize],
//     pub __align: ::std::os::raw::c_long,
// }
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlockattr_t>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlockattr_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __align ) ));
}
// impl Clone for pthread_rwlockattr_t {
//     fn clone(&self) -> Self { *self }
// }
pub type pthread_spinlock_t = ::std::os::raw::c_int;
// #[repr(C)]
// #[derive(Copy)]
// pub union pthread_barrier_t {
//     pub __size: [::std::os::raw::c_char; 32usize],
//     pub __align: ::std::os::raw::c_long,
// }
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrier_t>() , 32usize , concat !
               ( "Size of: " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_barrier_t>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __align ) ));
}
// impl Clone for pthread_barrier_t {
//     fn clone(&self) -> Self { *self }
// }
// #[repr(C)]
// #[derive(Copy)]
// pub union pthread_barrierattr_t {
//     pub __size: [::std::os::raw::c_char; 4usize],
//     pub __align: ::std::os::raw::c_int,
// }
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrierattr_t>() , 4usize ,
               concat ! ( "Size of: " , stringify ! ( pthread_barrierattr_t )
               ));
    assert_eq! (::std::mem::align_of::<pthread_barrierattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_barrierattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __align ) ));
}
// impl Clone for pthread_barrierattr_t {
//     fn clone(&self) -> Self { *self }
// }
pub type int_least8_t = ::std::os::raw::c_char;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_char;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    assert_eq!(::std::mem::size_of::<iovec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( iovec ) ));
    assert_eq! (::std::mem::align_of::<iovec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( iovec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const iovec ) ) . iov_base as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( iovec ) , "::" ,
                stringify ! ( iov_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const iovec ) ) . iov_len as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( iovec ) , "::" ,
                stringify ! ( iov_len ) ));
}
impl Clone for iovec {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn readv(__fd: ::std::os::raw::c_int, __iovec: *const iovec,
                 __count: ::std::os::raw::c_int) -> isize;
}
extern "C" {
    pub fn writev(__fd: ::std::os::raw::c_int, __iovec: *const iovec,
                  __count: ::std::os::raw::c_int) -> isize;
}
extern "C" {
    pub fn preadv(__fd: ::std::os::raw::c_int, __iovec: *const iovec,
                  __count: ::std::os::raw::c_int, __offset: __off_t) -> isize;
}
extern "C" {
    pub fn pwritev(__fd: ::std::os::raw::c_int, __iovec: *const iovec,
                   __count: ::std::os::raw::c_int, __offset: __off_t)
     -> isize;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sched_param {
    pub __sched_priority: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sched_param() {
    assert_eq!(::std::mem::size_of::<sched_param>() , 4usize , concat ! (
               "Size of: " , stringify ! ( sched_param ) ));
    assert_eq! (::std::mem::align_of::<sched_param>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( sched_param ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sched_param ) ) . __sched_priority as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sched_param ) , "::" ,
                stringify ! ( __sched_priority ) ));
}
impl Clone for sched_param {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __sched_param {
    pub __sched_priority: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___sched_param() {
    assert_eq!(::std::mem::size_of::<__sched_param>() , 4usize , concat ! (
               "Size of: " , stringify ! ( __sched_param ) ));
    assert_eq! (::std::mem::align_of::<__sched_param>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __sched_param ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __sched_param ) ) . __sched_priority as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __sched_param ) , "::"
                , stringify ! ( __sched_priority ) ));
}
impl Clone for __sched_param {
    fn clone(&self) -> Self { *self }
}
pub type __cpu_mask = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 16usize],
}
#[test]
fn bindgen_test_layout_cpu_set_t() {
    assert_eq!(::std::mem::size_of::<cpu_set_t>() , 128usize , concat ! (
               "Size of: " , stringify ! ( cpu_set_t ) ));
    assert_eq! (::std::mem::align_of::<cpu_set_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( cpu_set_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cpu_set_t ) ) . __bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cpu_set_t ) , "::" ,
                stringify ! ( __bits ) ));
}
impl Clone for cpu_set_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn __sched_cpucount(__setsize: usize, __setp: *const cpu_set_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __sched_cpualloc(__count: usize) -> *mut cpu_set_t;
}
extern "C" {
    pub fn __sched_cpufree(__set: *mut cpu_set_t);
}
extern "C" {
    pub fn sched_setparam(__pid: __pid_t, __param: *const sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_getparam(__pid: __pid_t, __param: *mut sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_setscheduler(__pid: __pid_t, __policy: ::std::os::raw::c_int,
                              __param: *const sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_getscheduler(__pid: __pid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_yield() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_get_priority_max(__algorithm: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_get_priority_min(__algorithm: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_rr_get_interval(__pid: __pid_t, __t: *mut timespec)
     -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(::std::mem::size_of::<tm>() , 56usize , concat ! (
               "Size of: " , stringify ! ( tm ) ));
    assert_eq! (::std::mem::align_of::<tm>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( tm ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_sec as * const _ as usize } ,
                0usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_min as * const _ as usize } ,
                4usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_min ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_hour as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_hour ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_mday as * const _ as usize }
                , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_mday ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_mon as * const _ as usize } ,
                16usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_mon ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_year as * const _ as usize }
                , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_year ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_wday as * const _ as usize }
                , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_wday ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_yday as * const _ as usize }
                , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_yday ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_isdst as * const _ as usize }
                , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_isdst ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_gmtoff as * const _ as usize
                } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_gmtoff ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tm ) ) . tm_zone as * const _ as usize }
                , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( tm ) , "::" , stringify
                ! ( tm_zone ) ));
}
impl Clone for tm {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(::std::mem::size_of::<itimerspec>() , 32usize , concat ! (
               "Size of: " , stringify ! ( itimerspec ) ));
    assert_eq! (::std::mem::align_of::<itimerspec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( itimerspec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerspec ) ) . it_interval as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerspec ) , "::" ,
                stringify ! ( it_interval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerspec ) ) . it_value as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerspec ) , "::" ,
                stringify ! ( it_value ) ));
}
impl Clone for itimerspec {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent([u8; 0]);
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(__s: *mut ::std::os::raw::c_char, __maxsize: usize,
                    __format: *const ::std::os::raw::c_char, __tp: *const tm)
     -> usize;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(::std::mem::size_of::<__locale_struct>() , 232usize , concat !
               ( "Size of: " , stringify ! ( __locale_struct ) ));
    assert_eq! (::std::mem::align_of::<__locale_struct>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( __locale_struct ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __locales as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __locales ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_b as *
                const _ as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_tolower as
                * const _ as usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_tolower ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_toupper as
                * const _ as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_toupper ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __names as * const
                _ as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __names ) ));
}
impl Clone for __locale_struct {
    fn clone(&self) -> Self { *self }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strftime_l(__s: *mut ::std::os::raw::c_char, __maxsize: usize,
                      __format: *const ::std::os::raw::c_char,
                      __tp: *const tm, __loc: __locale_t) -> usize;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asctime_r(__tp: *const tm, __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(__timer: *const time_t, __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "__tzname"]
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    #[link_name = "__daylight"]
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__timezone"]
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "tzname"]
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    #[link_name = "daylight"]
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "timezone"]
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub fn stime(__when: *const time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(__requested_time: *const timespec,
                     __remaining: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(__clock_id: clockid_t,
                           __flags: ::std::os::raw::c_int,
                           __req: *const timespec, __rem: *mut timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_create(__clock_id: clockid_t, __evp: *mut sigevent,
                        __timerid: *mut timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(__timerid: timer_t, __flags: ::std::os::raw::c_int,
                         __value: *const itimerspec,
                         __ovalue: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(__ts: *mut timespec, __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
pub type __jmp_buf = [::std::os::raw::c_long; 8usize];
pub const PTHREAD_CREATE_JOINABLE: _bindgen_ty_1 =
    _bindgen_ty_1::PTHREAD_CREATE_JOINABLE;
pub const PTHREAD_CREATE_DETACHED: _bindgen_ty_1 =
    _bindgen_ty_1::PTHREAD_CREATE_DETACHED;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_1 {
    PTHREAD_CREATE_JOINABLE = 0,
    PTHREAD_CREATE_DETACHED = 1,
}
pub const PTHREAD_MUTEX_TIMED_NP: _bindgen_ty_2 =
    _bindgen_ty_2::PTHREAD_MUTEX_TIMED_NP;
pub const PTHREAD_MUTEX_RECURSIVE_NP: _bindgen_ty_2 =
    _bindgen_ty_2::PTHREAD_MUTEX_RECURSIVE_NP;
pub const PTHREAD_MUTEX_ERRORCHECK_NP: _bindgen_ty_2 =
    _bindgen_ty_2::PTHREAD_MUTEX_ERRORCHECK_NP;
pub const PTHREAD_MUTEX_ADAPTIVE_NP: _bindgen_ty_2 =
    _bindgen_ty_2::PTHREAD_MUTEX_ADAPTIVE_NP;
pub const PTHREAD_MUTEX_NORMAL: _bindgen_ty_2 =
    _bindgen_ty_2::PTHREAD_MUTEX_TIMED_NP;
pub const PTHREAD_MUTEX_RECURSIVE: _bindgen_ty_2 =
    _bindgen_ty_2::PTHREAD_MUTEX_RECURSIVE_NP;
pub const PTHREAD_MUTEX_ERRORCHECK: _bindgen_ty_2 =
    _bindgen_ty_2::PTHREAD_MUTEX_ERRORCHECK_NP;
pub const PTHREAD_MUTEX_DEFAULT: _bindgen_ty_2 =
    _bindgen_ty_2::PTHREAD_MUTEX_TIMED_NP;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_2 {
    PTHREAD_MUTEX_TIMED_NP = 0,
    PTHREAD_MUTEX_RECURSIVE_NP = 1,
    PTHREAD_MUTEX_ERRORCHECK_NP = 2,
    PTHREAD_MUTEX_ADAPTIVE_NP = 3,
}
pub const PTHREAD_MUTEX_STALLED: _bindgen_ty_3 =
    _bindgen_ty_3::PTHREAD_MUTEX_STALLED;
pub const PTHREAD_MUTEX_STALLED_NP: _bindgen_ty_3 =
    _bindgen_ty_3::PTHREAD_MUTEX_STALLED;
pub const PTHREAD_MUTEX_ROBUST: _bindgen_ty_3 =
    _bindgen_ty_3::PTHREAD_MUTEX_ROBUST;
pub const PTHREAD_MUTEX_ROBUST_NP: _bindgen_ty_3 =
    _bindgen_ty_3::PTHREAD_MUTEX_ROBUST;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_3 {
    PTHREAD_MUTEX_STALLED = 0,
    PTHREAD_MUTEX_ROBUST = 1,
}
pub const PTHREAD_PRIO_NONE: _bindgen_ty_4 = _bindgen_ty_4::PTHREAD_PRIO_NONE;
pub const PTHREAD_PRIO_INHERIT: _bindgen_ty_4 =
    _bindgen_ty_4::PTHREAD_PRIO_INHERIT;
pub const PTHREAD_PRIO_PROTECT: _bindgen_ty_4 =
    _bindgen_ty_4::PTHREAD_PRIO_PROTECT;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_4 {
    PTHREAD_PRIO_NONE = 0,
    PTHREAD_PRIO_INHERIT = 1,
    PTHREAD_PRIO_PROTECT = 2,
}
pub const PTHREAD_RWLOCK_PREFER_READER_NP: _bindgen_ty_5 =
    _bindgen_ty_5::PTHREAD_RWLOCK_PREFER_READER_NP;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NP: _bindgen_ty_5 =
    _bindgen_ty_5::PTHREAD_RWLOCK_PREFER_WRITER_NP;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP: _bindgen_ty_5 =
    _bindgen_ty_5::PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP;
pub const PTHREAD_RWLOCK_DEFAULT_NP: _bindgen_ty_5 =
    _bindgen_ty_5::PTHREAD_RWLOCK_PREFER_READER_NP;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_5 {
    PTHREAD_RWLOCK_PREFER_READER_NP = 0,
    PTHREAD_RWLOCK_PREFER_WRITER_NP = 1,
    PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP = 2,
}
pub const PTHREAD_INHERIT_SCHED: _bindgen_ty_6 =
    _bindgen_ty_6::PTHREAD_INHERIT_SCHED;
pub const PTHREAD_EXPLICIT_SCHED: _bindgen_ty_6 =
    _bindgen_ty_6::PTHREAD_EXPLICIT_SCHED;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_6 {
    PTHREAD_INHERIT_SCHED = 0,
    PTHREAD_EXPLICIT_SCHED = 1,
}
pub const PTHREAD_SCOPE_SYSTEM: _bindgen_ty_7 =
    _bindgen_ty_7::PTHREAD_SCOPE_SYSTEM;
pub const PTHREAD_SCOPE_PROCESS: _bindgen_ty_7 =
    _bindgen_ty_7::PTHREAD_SCOPE_PROCESS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_7 {
    PTHREAD_SCOPE_SYSTEM = 0,
    PTHREAD_SCOPE_PROCESS = 1,
}
pub const PTHREAD_PROCESS_PRIVATE: _bindgen_ty_8 =
    _bindgen_ty_8::PTHREAD_PROCESS_PRIVATE;
pub const PTHREAD_PROCESS_SHARED: _bindgen_ty_8 =
    _bindgen_ty_8::PTHREAD_PROCESS_SHARED;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_8 {
    PTHREAD_PROCESS_PRIVATE = 0,
    PTHREAD_PROCESS_SHARED = 1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _pthread_cleanup_buffer {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                  *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __canceltype: ::std::os::raw::c_int,
    pub __prev: *mut _pthread_cleanup_buffer,
}
#[test]
fn bindgen_test_layout__pthread_cleanup_buffer() {
    assert_eq!(::std::mem::size_of::<_pthread_cleanup_buffer>() , 32usize ,
               concat ! (
               "Size of: " , stringify ! ( _pthread_cleanup_buffer ) ));
    assert_eq! (::std::mem::align_of::<_pthread_cleanup_buffer>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _pthread_cleanup_buffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _pthread_cleanup_buffer ) ) . __routine
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _pthread_cleanup_buffer
                ) , "::" , stringify ! ( __routine ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _pthread_cleanup_buffer ) ) . __arg as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _pthread_cleanup_buffer
                ) , "::" , stringify ! ( __arg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _pthread_cleanup_buffer ) ) .
                __canceltype as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _pthread_cleanup_buffer
                ) , "::" , stringify ! ( __canceltype ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _pthread_cleanup_buffer ) ) . __prev as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _pthread_cleanup_buffer
                ) , "::" , stringify ! ( __prev ) ));
}
impl Clone for _pthread_cleanup_buffer {
    fn clone(&self) -> Self { *self }
}
pub const PTHREAD_CANCEL_ENABLE: _bindgen_ty_9 =
    _bindgen_ty_9::PTHREAD_CANCEL_ENABLE;
pub const PTHREAD_CANCEL_DISABLE: _bindgen_ty_9 =
    _bindgen_ty_9::PTHREAD_CANCEL_DISABLE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_9 {
    PTHREAD_CANCEL_ENABLE = 0,
    PTHREAD_CANCEL_DISABLE = 1,
}
pub const PTHREAD_CANCEL_DEFERRED: _bindgen_ty_10 =
    _bindgen_ty_10::PTHREAD_CANCEL_DEFERRED;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: _bindgen_ty_10 =
    _bindgen_ty_10::PTHREAD_CANCEL_ASYNCHRONOUS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_10 {
    PTHREAD_CANCEL_DEFERRED = 0,
    PTHREAD_CANCEL_ASYNCHRONOUS = 1,
}
// extern "C" {
//     pub fn pthread_create(__newthread: *mut pthread_t,
//                           __attr: *const pthread_attr_t,
//                           __start_routine:
//                               ::std::option::Option<unsafe extern "C" fn(arg1:
//                                                                              *mut ::std::os::raw::c_void)
//                                                         ->
//                                                             *mut ::std::os::raw::c_void>,
//                           __arg: *mut ::std::os::raw::c_void)
//      -> ::std::os::raw::c_int;
// }
extern "C" {
    pub fn pthread_exit(__retval: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn pthread_join(__th: pthread_t,
                        __thread_return: *mut *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_detach(__th: pthread_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_self() -> pthread_t;
}
extern "C" {
    pub fn pthread_equal(__thread1: pthread_t, __thread2: pthread_t)
     -> ::std::os::raw::c_int;
}
// extern "C" {
//     pub fn pthread_attr_init(__attr: *mut pthread_attr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_destroy(__attr: *mut pthread_attr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_getdetachstate(__attr: *const pthread_attr_t,
//                                        __detachstate:
//                                            *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_setdetachstate(__attr: *mut pthread_attr_t,
//                                        __detachstate: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_getguardsize(__attr: *const pthread_attr_t,
//                                      __guardsize: *mut usize)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_setguardsize(__attr: *mut pthread_attr_t,
//                                      __guardsize: usize)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_getschedparam(__attr: *const pthread_attr_t,
//                                       __param: *mut sched_param)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_setschedparam(__attr: *mut pthread_attr_t,
//                                       __param: *const sched_param)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_getschedpolicy(__attr: *const pthread_attr_t,
//                                        __policy: *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_setschedpolicy(__attr: *mut pthread_attr_t,
//                                        __policy: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_getinheritsched(__attr: *const pthread_attr_t,
//                                         __inherit: *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_setinheritsched(__attr: *mut pthread_attr_t,
//                                         __inherit: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_getscope(__attr: *const pthread_attr_t,
//                                  __scope: *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_setscope(__attr: *mut pthread_attr_t,
//                                  __scope: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_getstackaddr(__attr: *const pthread_attr_t,
//                                      __stackaddr:
//                                          *mut *mut ::std::os::raw::c_void)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_setstackaddr(__attr: *mut pthread_attr_t,
//                                      __stackaddr: *mut ::std::os::raw::c_void)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_getstacksize(__attr: *const pthread_attr_t,
//                                      __stacksize: *mut usize)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_setstacksize(__attr: *mut pthread_attr_t,
//                                      __stacksize: usize)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_getstack(__attr: *const pthread_attr_t,
//                                  __stackaddr:
//                                      *mut *mut ::std::os::raw::c_void,
//                                  __stacksize: *mut usize)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_attr_setstack(__attr: *mut pthread_attr_t,
//                                  __stackaddr: *mut ::std::os::raw::c_void,
//                                  __stacksize: usize) -> ::std::os::raw::c_int;
// }
extern "C" {
    pub fn pthread_setschedparam(__target_thread: pthread_t,
                                 __policy: ::std::os::raw::c_int,
                                 __param: *const sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_getschedparam(__target_thread: pthread_t,
                                 __policy: *mut ::std::os::raw::c_int,
                                 __param: *mut sched_param)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setschedprio(__target_thread: pthread_t,
                                __prio: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_once(__once_control: *mut pthread_once_t,
                        __init_routine:
                            ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setcancelstate(__state: ::std::os::raw::c_int,
                                  __oldstate: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setcanceltype(__type: ::std::os::raw::c_int,
                                 __oldtype: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cancel(__th: pthread_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_testcancel();
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_unwind_buf_t {
    pub __cancel_jmp_buf: [__pthread_unwind_buf_t__bindgen_ty_1; 1usize],
    pub __pad: [*mut ::std::os::raw::c_void; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_unwind_buf_t__bindgen_ty_1 {
    pub __cancel_jmp_buf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___pthread_unwind_buf_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<__pthread_unwind_buf_t__bindgen_ty_1>() ,
               72usize , concat ! (
               "Size of: " , stringify ! (
               __pthread_unwind_buf_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<__pthread_unwind_buf_t__bindgen_ty_1>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                __pthread_unwind_buf_t__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_unwind_buf_t__bindgen_ty_1 ) )
                . __cancel_jmp_buf as * const _ as usize } , 0usize , concat !
                (
                "Alignment of field: " , stringify ! (
                __pthread_unwind_buf_t__bindgen_ty_1 ) , "::" , stringify ! (
                __cancel_jmp_buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_unwind_buf_t__bindgen_ty_1 ) )
                . __mask_was_saved as * const _ as usize } , 64usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                __pthread_unwind_buf_t__bindgen_ty_1 ) , "::" , stringify ! (
                __mask_was_saved ) ));
}
impl Clone for __pthread_unwind_buf_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout___pthread_unwind_buf_t() {
    assert_eq!(::std::mem::size_of::<__pthread_unwind_buf_t>() , 104usize ,
               concat ! ( "Size of: " , stringify ! ( __pthread_unwind_buf_t )
               ));
    assert_eq! (::std::mem::align_of::<__pthread_unwind_buf_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( __pthread_unwind_buf_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_unwind_buf_t ) ) .
                __cancel_jmp_buf as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_unwind_buf_t
                ) , "::" , stringify ! ( __cancel_jmp_buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_unwind_buf_t ) ) . __pad as *
                const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_unwind_buf_t
                ) , "::" , stringify ! ( __pad ) ));
}
impl Clone for __pthread_unwind_buf_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_cleanup_frame {
    pub __cancel_routine: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                         *mut ::std::os::raw::c_void)>,
    pub __cancel_arg: *mut ::std::os::raw::c_void,
    pub __do_it: ::std::os::raw::c_int,
    pub __cancel_type: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___pthread_cleanup_frame() {
    assert_eq!(::std::mem::size_of::<__pthread_cleanup_frame>() , 24usize ,
               concat ! (
               "Size of: " , stringify ! ( __pthread_cleanup_frame ) ));
    assert_eq! (::std::mem::align_of::<__pthread_cleanup_frame>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( __pthread_cleanup_frame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cleanup_frame ) ) .
                __cancel_routine as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_cleanup_frame
                ) , "::" , stringify ! ( __cancel_routine ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cleanup_frame ) ) .
                __cancel_arg as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_cleanup_frame
                ) , "::" , stringify ! ( __cancel_arg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cleanup_frame ) ) . __do_it as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_cleanup_frame
                ) , "::" , stringify ! ( __do_it ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_cleanup_frame ) ) .
                __cancel_type as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_cleanup_frame
                ) , "::" , stringify ! ( __cancel_type ) ));
}
impl Clone for __pthread_cleanup_frame {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn __pthread_register_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unregister_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unwind_next(__buf: *mut __pthread_unwind_buf_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_tag([u8; 0]);
extern "C" {
    pub fn __sigsetjmp(__env: *mut __jmp_buf_tag,
                       __savemask: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
// extern "C" {
//     pub fn pthread_mutex_init(__mutex: *mut pthread_mutex_t,
//                               __mutexattr: *const pthread_mutexattr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutex_destroy(__mutex: *mut pthread_mutex_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutex_trylock(__mutex: *mut pthread_mutex_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutex_lock(__mutex: *mut pthread_mutex_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutex_timedlock(__mutex: *mut pthread_mutex_t,
//                                    __abstime: *const timespec)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutex_unlock(__mutex: *mut pthread_mutex_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutex_getprioceiling(__mutex: *const pthread_mutex_t,
//                                         __prioceiling:
//                                             *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutex_setprioceiling(__mutex: *mut pthread_mutex_t,
//                                         __prioceiling: ::std::os::raw::c_int,
//                                         __old_ceiling:
//                                             *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutex_consistent(__mutex: *mut pthread_mutex_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_init(__attr: *mut pthread_mutexattr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_destroy(__attr: *mut pthread_mutexattr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_getpshared(__attr: *const pthread_mutexattr_t,
//                                         __pshared: *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_setpshared(__attr: *mut pthread_mutexattr_t,
//                                         __pshared: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_gettype(__attr: *const pthread_mutexattr_t,
//                                      __kind: *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_settype(__attr: *mut pthread_mutexattr_t,
//                                      __kind: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_getprotocol(__attr: *const pthread_mutexattr_t,
//                                          __protocol:
//                                              *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_setprotocol(__attr: *mut pthread_mutexattr_t,
//                                          __protocol: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_getprioceiling(__attr:
//                                                 *const pthread_mutexattr_t,
//                                             __prioceiling:
//                                                 *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_setprioceiling(__attr: *mut pthread_mutexattr_t,
//                                             __prioceiling:
//                                                 ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_getrobust(__attr: *const pthread_mutexattr_t,
//                                        __robustness:
//                                            *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_mutexattr_setrobust(__attr: *mut pthread_mutexattr_t,
//                                        __robustness: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlock_init(__rwlock: *mut pthread_rwlock_t,
//                                __attr: *const pthread_rwlockattr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlock_destroy(__rwlock: *mut pthread_rwlock_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlock_rdlock(__rwlock: *mut pthread_rwlock_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlock_tryrdlock(__rwlock: *mut pthread_rwlock_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlock_timedrdlock(__rwlock: *mut pthread_rwlock_t,
//                                       __abstime: *const timespec)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlock_wrlock(__rwlock: *mut pthread_rwlock_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlock_trywrlock(__rwlock: *mut pthread_rwlock_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlock_timedwrlock(__rwlock: *mut pthread_rwlock_t,
//                                       __abstime: *const timespec)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlock_unlock(__rwlock: *mut pthread_rwlock_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlockattr_init(__attr: *mut pthread_rwlockattr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlockattr_destroy(__attr: *mut pthread_rwlockattr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlockattr_getpshared(__attr: *const pthread_rwlockattr_t,
//                                          __pshared:
//                                              *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlockattr_setpshared(__attr: *mut pthread_rwlockattr_t,
//                                          __pshared: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlockattr_getkind_np(__attr: *const pthread_rwlockattr_t,
//                                          __pref: *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_rwlockattr_setkind_np(__attr: *mut pthread_rwlockattr_t,
//                                          __pref: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_cond_init(__cond: *mut pthread_cond_t,
//                              __cond_attr: *const pthread_condattr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_cond_destroy(__cond: *mut pthread_cond_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_cond_signal(__cond: *mut pthread_cond_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_cond_broadcast(__cond: *mut pthread_cond_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_cond_wait(__cond: *mut pthread_cond_t,
//                              __mutex: *mut pthread_mutex_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_cond_timedwait(__cond: *mut pthread_cond_t,
//                                   __mutex: *mut pthread_mutex_t,
//                                   __abstime: *const timespec)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_condattr_init(__attr: *mut pthread_condattr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_condattr_destroy(__attr: *mut pthread_condattr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_condattr_getpshared(__attr: *const pthread_condattr_t,
//                                        __pshared: *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_condattr_setpshared(__attr: *mut pthread_condattr_t,
//                                        __pshared: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_condattr_getclock(__attr: *const pthread_condattr_t,
//                                      __clock_id: *mut __clockid_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_condattr_setclock(__attr: *mut pthread_condattr_t,
//                                      __clock_id: __clockid_t)
//      -> ::std::os::raw::c_int;
// }
extern "C" {
    pub fn pthread_spin_init(__lock: *mut pthread_spinlock_t,
                             __pshared: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_spin_destroy(__lock: *mut pthread_spinlock_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_spin_lock(__lock: *mut pthread_spinlock_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_spin_trylock(__lock: *mut pthread_spinlock_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_spin_unlock(__lock: *mut pthread_spinlock_t)
     -> ::std::os::raw::c_int;
}
// extern "C" {
//     pub fn pthread_barrier_init(__barrier: *mut pthread_barrier_t,
//                                 __attr: *const pthread_barrierattr_t,
//                                 __count: ::std::os::raw::c_uint)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_barrier_destroy(__barrier: *mut pthread_barrier_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_barrier_wait(__barrier: *mut pthread_barrier_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_barrierattr_init(__attr: *mut pthread_barrierattr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_barrierattr_destroy(__attr: *mut pthread_barrierattr_t)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_barrierattr_getpshared(__attr:
//                                               *const pthread_barrierattr_t,
//                                           __pshared:
//                                               *mut ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
// extern "C" {
//     pub fn pthread_barrierattr_setpshared(__attr: *mut pthread_barrierattr_t,
//                                           __pshared: ::std::os::raw::c_int)
//      -> ::std::os::raw::c_int;
// }
extern "C" {
    pub fn pthread_key_create(__key: *mut pthread_key_t,
                              __destr_function:
                                  ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                                 *mut ::std::os::raw::c_void)>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_key_delete(__key: pthread_key_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_getspecific(__key: pthread_key_t)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pthread_setspecific(__key: pthread_key_t,
                               __pointer: *const ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_getcpuclockid(__thread_id: pthread_t,
                                 __clock_id: *mut __clockid_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_atfork(__prepare:
                              ::std::option::Option<unsafe extern "C" fn()>,
                          __parent:
                              ::std::option::Option<unsafe extern "C" fn()>,
                          __child:
                              ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_connection_t([u8; 0]);
/**
 * @brief Generic iterator.
 *
 * A generic iterator structure.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_generic_iterator_t {
    /**< Data of the current iterator */
    pub data: *mut ::std::os::raw::c_void,
    /**< remaining elements */
    pub rem: ::std::os::raw::c_int,
    /**< index of the current iterator */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_generic_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_generic_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_generic_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_generic_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_generic_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_iterator_t
                ) , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_iterator_t
                ) , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_iterator_t
                ) , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_generic_iterator_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief Generic reply.
 *
 * A generic reply structure.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_generic_reply_t {
    /**< Type of the response */
    pub response_type: u8,
    /**< Padding */
    pub pad0: u8,
    /**< Sequence number */
    pub sequence: u16,
    /**< Length of the response */
    pub length: u32,
}
#[test]
fn bindgen_test_layout_xcb_generic_reply_t() {
    assert_eq!(::std::mem::size_of::<xcb_generic_reply_t>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( xcb_generic_reply_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_generic_reply_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_generic_reply_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_reply_t ) ) . response_type
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_reply_t ) ,
                "::" , stringify ! ( response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_reply_t ) ) . pad0 as * const
                _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_reply_t ) ,
                "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_reply_t ) ) . sequence as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_reply_t ) ,
                "::" , stringify ! ( sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_reply_t ) ) . length as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_reply_t ) ,
                "::" , stringify ! ( length ) ));
}
impl Clone for xcb_generic_reply_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief Generic event.
 *
 * A generic event structure.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_generic_event_t {
    /**< Type of the response */
    pub response_type: u8,
    /**< Padding */
    pub pad0: u8,
    /**< Sequence number */
    pub sequence: u16,
    /**< Padding */
    pub pad: [u32; 7usize],
    /**< full sequence */
    pub full_sequence: u32,
}
#[test]
fn bindgen_test_layout_xcb_generic_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_generic_event_t>() , 36usize , concat
               ! ( "Size of: " , stringify ! ( xcb_generic_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_generic_event_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_generic_event_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_event_t ) ) . response_type
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_event_t ) ,
                "::" , stringify ! ( response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_event_t ) ) . pad0 as * const
                _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_event_t ) ,
                "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_event_t ) ) . sequence as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_event_t ) ,
                "::" , stringify ! ( sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_event_t ) ) . pad as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_event_t ) ,
                "::" , stringify ! ( pad ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_event_t ) ) . full_sequence
                as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_event_t ) ,
                "::" , stringify ! ( full_sequence ) ));
}
impl Clone for xcb_generic_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief GE event
 *
 * An event as sent by the XGE extension. The length field specifies the
 * number of 4-byte blocks trailing the struct.
 *
 * @deprecated Since some fields in this struct have unfortunate names, it is
 * recommended to use xcb_ge_generic_event_t instead.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_ge_event_t {
    /**< Type of the response */
    pub response_type: u8,
    /**< Padding */
    pub pad0: u8,
    /**< Sequence number */
    pub sequence: u16,
    pub length: u32,
    pub event_type: u16,
    pub pad1: u16,
    /**< Padding */
    pub pad: [u32; 5usize],
    /**< full sequence */
    pub full_sequence: u32,
}
#[test]
fn bindgen_test_layout_xcb_ge_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_ge_event_t>() , 36usize , concat ! (
               "Size of: " , stringify ! ( xcb_ge_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_ge_event_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( xcb_ge_event_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_ge_event_t ) ) . response_type as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_ge_event_t ) , "::"
                , stringify ! ( response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_ge_event_t ) ) . pad0 as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_ge_event_t ) , "::"
                , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_ge_event_t ) ) . sequence as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_ge_event_t ) , "::"
                , stringify ! ( sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_ge_event_t ) ) . length as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_ge_event_t ) , "::"
                , stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_ge_event_t ) ) . event_type as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_ge_event_t ) , "::"
                , stringify ! ( event_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_ge_event_t ) ) . pad1 as * const _ as
                usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_ge_event_t ) , "::"
                , stringify ! ( pad1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_ge_event_t ) ) . pad as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_ge_event_t ) , "::"
                , stringify ! ( pad ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_ge_event_t ) ) . full_sequence as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_ge_event_t ) , "::"
                , stringify ! ( full_sequence ) ));
}
impl Clone for xcb_ge_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief Generic error.
 *
 * A generic error structure.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_generic_error_t {
    /**< Type of the response */
    pub response_type: u8,
    /**< Error code */
    pub error_code: u8,
    /**< Sequence number */
    pub sequence: u16,
    pub resource_id: u32,
    /** < Resource ID for requests with side effects only */
    pub minor_code: u16,
    /** < Minor opcode of the failed request */
    pub major_code: u8,
    /** < Major opcode of the failed request */
    pub pad0: u8,
    /**< Padding */
    pub pad: [u32; 5usize],
    /**< full sequence */
    pub full_sequence: u32,
}
#[test]
fn bindgen_test_layout_xcb_generic_error_t() {
    assert_eq!(::std::mem::size_of::<xcb_generic_error_t>() , 36usize , concat
               ! ( "Size of: " , stringify ! ( xcb_generic_error_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_generic_error_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_generic_error_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_error_t ) ) . response_type
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_error_t ) ,
                "::" , stringify ! ( response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_error_t ) ) . error_code as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_error_t ) ,
                "::" , stringify ! ( error_code ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_error_t ) ) . sequence as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_error_t ) ,
                "::" , stringify ! ( sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_error_t ) ) . resource_id as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_error_t ) ,
                "::" , stringify ! ( resource_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_error_t ) ) . minor_code as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_error_t ) ,
                "::" , stringify ! ( minor_code ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_error_t ) ) . major_code as *
                const _ as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_error_t ) ,
                "::" , stringify ! ( major_code ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_error_t ) ) . pad0 as * const
                _ as usize } , 11usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_error_t ) ,
                "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_error_t ) ) . pad as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_error_t ) ,
                "::" , stringify ! ( pad ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_generic_error_t ) ) . full_sequence
                as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_generic_error_t ) ,
                "::" , stringify ! ( full_sequence ) ));
}
impl Clone for xcb_generic_error_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief Generic cookie.
 *
 * A generic cookie structure.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_void_cookie_t {
    /**< Sequence number */
    pub sequence: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_xcb_void_cookie_t() {
    assert_eq!(::std::mem::size_of::<xcb_void_cookie_t>() , 4usize , concat !
               ( "Size of: " , stringify ! ( xcb_void_cookie_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_void_cookie_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( xcb_void_cookie_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_void_cookie_t ) ) . sequence as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_void_cookie_t ) ,
                "::" , stringify ! ( sequence ) ));
}
impl Clone for xcb_void_cookie_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief Container for authorization information.
 *
 * A container for authorization information to be sent to the X server.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_auth_info_t {
    /**< Length of the string name (as returned by strlen). */
    pub namelen: ::std::os::raw::c_int,
    /**< String containing the authentication protocol name, such as "MIT-MAGIC-COOKIE-1" or "XDM-AUTHORIZATION-1". */
    pub name: *mut ::std::os::raw::c_char,
    /**< Length of the data member. */
    pub datalen: ::std::os::raw::c_int,
    /**< Data interpreted in a protocol-specific manner. */
    pub data: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_xcb_auth_info_t() {
    assert_eq!(::std::mem::size_of::<xcb_auth_info_t>() , 32usize , concat ! (
               "Size of: " , stringify ! ( xcb_auth_info_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_auth_info_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( xcb_auth_info_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_auth_info_t ) ) . namelen as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_auth_info_t ) ,
                "::" , stringify ! ( namelen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_auth_info_t ) ) . name as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_auth_info_t ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_auth_info_t ) ) . datalen as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_auth_info_t ) ,
                "::" , stringify ! ( datalen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_auth_info_t ) ) . data as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_auth_info_t ) ,
                "::" , stringify ! ( data ) ));
}
impl Clone for xcb_auth_info_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /**
 * @brief Forces any buffered output to be written to the server.
 * @param c: The connection to the X server.
 * @return > @c 0 on success, <= @c 0 otherwise.
 *
 * Forces any buffered output to be written to the server. Blocks
 * until the write is complete.
 */
    pub fn xcb_flush(c: *mut xcb_connection_t) -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * @brief Returns the maximum request length that this server accepts.
 * @param c: The connection to the X server.
 * @return The maximum request length field.
 *
 * In the absence of the BIG-REQUESTS extension, returns the
 * maximum request length field from the connection setup data, which
 * may be as much as 65535. If the server supports BIG-REQUESTS, then
 * the maximum request length field from the reply to the
 * BigRequestsEnable request will be returned instead.
 *
 * Note that this length is measured in four-byte units, making the
 * theoretical maximum lengths roughly 256kB without BIG-REQUESTS and
 * 16GB with.
 */
    pub fn xcb_get_maximum_request_length(c: *mut xcb_connection_t) -> u32;
}
extern "C" {
    /**
 * @brief Prefetch the maximum request length without blocking.
 * @param c: The connection to the X server.
 *
 * Without blocking, does as much work as possible toward computing
 * the maximum request length accepted by the X server.
 *
 * Invoking this function may cause a call to xcb_big_requests_enable,
 * but will not block waiting for the reply.
 * xcb_get_maximum_request_length will return the prefetched data
 * after possibly blocking while the reply is retrieved.
 *
 * Note that in order for this function to be fully non-blocking, the
 * application must previously have called
 * xcb_prefetch_extension_data(c, &xcb_big_requests_id) and the reply
 * must have already arrived.
 */
    pub fn xcb_prefetch_maximum_request_length(c: *mut xcb_connection_t);
}
extern "C" {
    /**
 * @brief Returns the next event or error from the server.
 * @param c: The connection to the X server.
 * @return The next event from the server.
 *
 * Returns the next event or error from the server, or returns null in
 * the event of an I/O error. Blocks until either an event or error
 * arrive, or an I/O error occurs.
 */
    pub fn xcb_wait_for_event(c: *mut xcb_connection_t)
     -> *mut xcb_generic_event_t;
}
extern "C" {
    /**
 * @brief Returns the next event or error from the server.
 * @param c: The connection to the X server.
 * @return The next event from the server.
 *
 * Returns the next event or error from the server, if one is
 * available, or returns @c NULL otherwise. If no event is available, that
 * might be because an I/O error like connection close occurred while
 * attempting to read the next event, in which case the connection is
 * shut down when this function returns.
 */
    pub fn xcb_poll_for_event(c: *mut xcb_connection_t)
     -> *mut xcb_generic_event_t;
}
extern "C" {
    /**
 * @brief Returns the next event without reading from the connection.
 * @param c: The connection to the X server.
 * @return The next already queued event from the server.
 *
 * This is a version of xcb_poll_for_event that only examines the
 * event queue for new events. The function doesn't try to read new
 * events from the connection if no queued events are found.
 *
 * This function is useful for callers that know in advance that all
 * interesting events have already been read from the connection. For
 * example, callers might use xcb_wait_for_reply and be interested
 * only of events that preceded a specific reply.
 */
    pub fn xcb_poll_for_queued_event(c: *mut xcb_connection_t)
     -> *mut xcb_generic_event_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_special_event([u8; 0]);
pub type xcb_special_event_t = xcb_special_event;
extern "C" {
    /**
 * @brief Returns the next event from a special queue
 */
    pub fn xcb_poll_for_special_event(c: *mut xcb_connection_t,
                                      se: *mut xcb_special_event_t)
     -> *mut xcb_generic_event_t;
}
extern "C" {
    /**
 * @brief Returns the next event from a special queue, blocking until one arrives
 */
    pub fn xcb_wait_for_special_event(c: *mut xcb_connection_t,
                                      se: *mut xcb_special_event_t)
     -> *mut xcb_generic_event_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_extension_t([u8; 0]);
extern "C" {
    /**
 * @brief Listen for a special event
 */
    pub fn xcb_register_for_special_xge(c: *mut xcb_connection_t,
                                        ext: *mut xcb_extension_t, eid: u32,
                                        stamp: *mut u32)
     -> *mut xcb_special_event_t;
}
extern "C" {
    /**
 * @brief Stop listening for a special event
 */
    pub fn xcb_unregister_for_special_event(c: *mut xcb_connection_t,
                                            se: *mut xcb_special_event_t);
}
extern "C" {
    /**
 * @brief Return the error for a request, or NULL if none can ever arrive.
 * @param c: The connection to the X server.
 * @param cookie: The request cookie.
 * @return The error for the request, or NULL if none can ever arrive.
 *
 * The xcb_void_cookie_t cookie supplied to this function must have resulted
 * from a call to xcb_[request_name]_checked().  This function will block
 * until one of two conditions happens.  If an error is received, it will be
 * returned.  If a reply to a subsequent request has already arrived, no error
 * can arrive for this request, so this function will return NULL.
 *
 * Note that this function will perform a sync if needed to ensure that the
 * sequence number will advance beyond that provided in cookie; this is a
 * convenience to avoid races in determining whether the sync is needed.
 */
    pub fn xcb_request_check(c: *mut xcb_connection_t,
                             cookie: xcb_void_cookie_t)
     -> *mut xcb_generic_error_t;
}
extern "C" {
    /**
 * @brief Discards the reply for a request.
 * @param c: The connection to the X server.
 * @param sequence: The request sequence number from a cookie.
 *
 * Discards the reply for a request. Additionally, any error generated
 * by the request is also discarded (unless it was an _unchecked request
 * and the error has already arrived).
 *
 * This function will not block even if the reply is not yet available.
 *
 * Note that the sequence really does have to come from an xcb cookie;
 * this function is not designed to operate on socket-handoff replies.
 */
    pub fn xcb_discard_reply(c: *mut xcb_connection_t,
                             sequence: ::std::os::raw::c_uint);
}
extern "C" {
    /**
 * @brief Discards the reply for a request, given by a 64bit sequence number
 * @param c: The connection to the X server.
 * @param sequence: 64-bit sequence number as returned by xcb_send_request64().
 *
 * Discards the reply for a request. Additionally, any error generated
 * by the request is also discarded (unless it was an _unchecked request
 * and the error has already arrived).
 *
 * This function will not block even if the reply is not yet available.
 *
 * Note that the sequence really does have to come from xcb_send_request64();
 * the cookie sequence number is defined as "unsigned" int and therefore
 * not 64-bit on all platforms.
 * This function is not designed to operate on socket-handoff replies.
 *
 * Unlike its xcb_discard_reply() counterpart, the given sequence number is not
 * automatically "widened" to 64-bit.
 */
    pub fn xcb_discard_reply64(c: *mut xcb_connection_t, sequence: u64);
}
/**
 * @brief xcb_query_extension_reply_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_query_extension_reply_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub length: u32,
    /**<  */
    pub present: u8,
    /**<  */
    pub major_opcode: u8,
    /**<  */
    pub first_event: u8,
    /**<  */
    pub first_error: u8,
}
#[test]
fn bindgen_test_layout_xcb_query_extension_reply_t() {
    assert_eq!(::std::mem::size_of::<xcb_query_extension_reply_t>() , 12usize
               , concat ! (
               "Size of: " , stringify ! ( xcb_query_extension_reply_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_query_extension_reply_t>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( xcb_query_extension_reply_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_query_extension_reply_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_query_extension_reply_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_query_extension_reply_t ) ) . pad0 as
                * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_query_extension_reply_t ) , "::" , stringify ! ( pad0 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_query_extension_reply_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_query_extension_reply_t ) , "::" , stringify ! ( sequence
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_query_extension_reply_t ) ) . length
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_query_extension_reply_t ) , "::" , stringify ! ( length )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_query_extension_reply_t ) ) . present
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_query_extension_reply_t ) , "::" , stringify ! ( present )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_query_extension_reply_t ) ) .
                major_opcode as * const _ as usize } , 9usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_query_extension_reply_t ) , "::" , stringify ! (
                major_opcode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_query_extension_reply_t ) ) .
                first_event as * const _ as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_query_extension_reply_t ) , "::" , stringify ! (
                first_event ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_query_extension_reply_t ) ) .
                first_error as * const _ as usize } , 11usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_query_extension_reply_t ) , "::" , stringify ! (
                first_error ) ));
}
impl Clone for xcb_query_extension_reply_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /**
 * @brief Caches reply information from QueryExtension requests.
 * @param c: The connection.
 * @param ext: The extension data.
 * @return A pointer to the xcb_query_extension_reply_t for the extension.
 *
 * This function is the primary interface to the "extension cache",
 * which caches reply information from QueryExtension
 * requests. Invoking this function may cause a call to
 * xcb_query_extension to retrieve extension information from the
 * server, and may block until extension data is received from the
 * server.
 *
 * The result must not be freed. This storage is managed by the cache
 * itself.
 */
    pub fn xcb_get_extension_data(c: *mut xcb_connection_t,
                                  ext: *mut xcb_extension_t)
     -> *const xcb_query_extension_reply_t;
}
extern "C" {
    /**
 * @brief Prefetch of extension data into the extension cache
 * @param c: The connection.
 * @param ext: The extension data.
 *
 * This function allows a "prefetch" of extension data into the
 * extension cache. Invoking the function may cause a call to
 * xcb_query_extension, but will not block waiting for the
 * reply. xcb_get_extension_data will return the prefetched data after
 * possibly blocking while it is retrieved.
 */
    pub fn xcb_prefetch_extension_data(c: *mut xcb_connection_t,
                                       ext: *mut xcb_extension_t);
}
/**
 * @brief xcb_setup_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_setup_t {
    /**<  */
    pub status: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub protocol_major_version: u16,
    /**<  */
    pub protocol_minor_version: u16,
    /**<  */
    pub length: u16,
    /**<  */
    pub release_number: u32,
    /**<  */
    pub resource_id_base: u32,
    /**<  */
    pub resource_id_mask: u32,
    /**<  */
    pub motion_buffer_size: u32,
    /**<  */
    pub vendor_len: u16,
    /**<  */
    pub maximum_request_length: u16,
    /**<  */
    pub roots_len: u8,
    /**<  */
    pub pixmap_formats_len: u8,
    /**<  */
    pub image_byte_order: u8,
    /**<  */
    pub bitmap_format_bit_order: u8,
    /**<  */
    pub bitmap_format_scanline_unit: u8,
    /**<  */
    pub bitmap_format_scanline_pad: u8,
    /**<  */
    pub min_keycode: xcb_keycode_t,
    /**<  */
    pub max_keycode: xcb_keycode_t,
    /**<  */
    pub pad1: [u8; 4usize],
}
#[test]
fn bindgen_test_layout_xcb_setup_t() {
    assert_eq!(::std::mem::size_of::<xcb_setup_t>() , 40usize , concat ! (
               "Size of: " , stringify ! ( xcb_setup_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_setup_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( xcb_setup_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . status as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( status ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . pad0 as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . protocol_major_version
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( protocol_major_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . protocol_minor_version
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( protocol_minor_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . length as * const _ as
                usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . release_number as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( release_number ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . resource_id_base as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( resource_id_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . resource_id_mask as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( resource_id_mask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . motion_buffer_size as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( motion_buffer_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . vendor_len as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( vendor_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . maximum_request_length
                as * const _ as usize } , 26usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( maximum_request_length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . roots_len as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( roots_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . pixmap_formats_len as *
                const _ as usize } , 29usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( pixmap_formats_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . image_byte_order as *
                const _ as usize } , 30usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( image_byte_order ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . bitmap_format_bit_order
                as * const _ as usize } , 31usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( bitmap_format_bit_order ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) .
                bitmap_format_scanline_unit as * const _ as usize } , 32usize
                , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( bitmap_format_scanline_unit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) .
                bitmap_format_scanline_pad as * const _ as usize } , 33usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( bitmap_format_scanline_pad ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . min_keycode as * const
                _ as usize } , 34usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( min_keycode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . max_keycode as * const
                _ as usize } , 35usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( max_keycode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_t ) ) . pad1 as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_t ) , "::" ,
                stringify ! ( pad1 ) ));
}
impl Clone for xcb_setup_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /**
 * @brief Access the data returned by the server.
 * @param c: The connection.
 * @return A pointer to an xcb_setup_t structure.
 *
 * Accessor for the data returned by the server when the xcb_connection_t
 * was initialized. This data includes
 * - the server's required format for images,
 * - a list of available visuals,
 * - a list of available screens,
 * - the server's maximum request length (in the absence of the
 * BIG-REQUESTS extension),
 * - and other assorted information.
 *
 * See the X protocol specification for more details.
 *
 * The result must not be freed.
 */
    pub fn xcb_get_setup(c: *mut xcb_connection_t) -> *const xcb_setup_t;
}
extern "C" {
    /**
 * @brief Access the file descriptor of the connection.
 * @param c: The connection.
 * @return The file descriptor.
 *
 * Accessor for the file descriptor that was passed to the
 * xcb_connect_to_fd call that returned @p c.
 */
    pub fn xcb_get_file_descriptor(c: *mut xcb_connection_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * @brief Test whether the connection has shut down due to a fatal error.
 * @param c: The connection.
 * @return > 0 if the connection is in an error state; 0 otherwise.
 *
 * Some errors that occur in the context of an xcb_connection_t
 * are unrecoverable. When such an error occurs, the
 * connection is shut down and further operations on the
 * xcb_connection_t have no effect, but memory will not be freed until
 * xcb_disconnect() is called on the xcb_connection_t.
 *
 * @return XCB_CONN_ERROR, because of socket errors, pipe errors or other stream errors.
 * @return XCB_CONN_CLOSED_EXT_NOTSUPPORTED, when extension not supported.
 * @return XCB_CONN_CLOSED_MEM_INSUFFICIENT, when memory not available.
 * @return XCB_CONN_CLOSED_REQ_LEN_EXCEED, exceeding request length that server accepts.
 * @return XCB_CONN_CLOSED_PARSE_ERR, error during parsing display string.
 * @return XCB_CONN_CLOSED_INVALID_SCREEN, because the server does not have a screen matching the display.
 */
    pub fn xcb_connection_has_error(c: *mut xcb_connection_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * @brief Connects to the X server.
 * @param fd: The file descriptor.
 * @param auth_info: Authentication data.
 * @return A newly allocated xcb_connection_t structure.
 *
 * Connects to an X server, given the open socket @p fd and the
 * xcb_auth_info_t @p auth_info. The file descriptor @p fd is
 * bidirectionally connected to an X server. If the connection
 * should be unauthenticated, @p auth_info must be @c
 * NULL.
 *
 * Always returns a non-NULL pointer to a xcb_connection_t, even on failure.
 * Callers need to use xcb_connection_has_error() to check for failure.
 * When finished, use xcb_disconnect() to close the connection and free
 * the structure.
 */
    pub fn xcb_connect_to_fd(fd: ::std::os::raw::c_int,
                             auth_info: *mut xcb_auth_info_t)
     -> *mut xcb_connection_t;
}
extern "C" {
    /**
 * @brief Closes the connection.
 * @param c: The connection.
 *
 * Closes the file descriptor and frees all memory associated with the
 * connection @c c. If @p c is @c NULL, nothing is done.
 */
    pub fn xcb_disconnect(c: *mut xcb_connection_t);
}
extern "C" {
    /**
 * @brief Parses a display string name in the form documented by X(7x).
 * @param name: The name of the display.
 * @param host: A pointer to a malloc'd copy of the hostname.
 * @param display: A pointer to the display number.
 * @param screen: A pointer to the screen number.
 * @return 0 on failure, non 0 otherwise.
 *
 * Parses the display string name @p display_name in the form
 * documented by X(7x). Has no side effects on failure. If
 * @p displayname is @c NULL or empty, it uses the environment
 * variable DISPLAY. @p hostp is a pointer to a newly allocated string
 * that contain the host name. @p displayp is set to the display
 * number and @p screenp to the preferred screen number. @p screenp
 * can be @c NULL. If @p displayname does not contain a screen number,
 * it is set to @c 0.
 */
    pub fn xcb_parse_display(name: *const ::std::os::raw::c_char,
                             host: *mut *mut ::std::os::raw::c_char,
                             display: *mut ::std::os::raw::c_int,
                             screen: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * @brief Connects to the X server.
 * @param displayname: The name of the display.
 * @param screenp: A pointer to a preferred screen number.
 * @return A newly allocated xcb_connection_t structure.
 *
 * Connects to the X server specified by @p displayname. If @p
 * displayname is @c NULL, uses the value of the DISPLAY environment
 * variable. If a particular screen on that server is preferred, the
 * int pointed to by @p screenp (if not @c NULL) will be set to that
 * screen; otherwise the screen will be set to 0.
 *
 * Always returns a non-NULL pointer to a xcb_connection_t, even on failure.
 * Callers need to use xcb_connection_has_error() to check for failure.
 * When finished, use xcb_disconnect() to close the connection and free
 * the structure.
 */
    pub fn xcb_connect(displayname: *const ::std::os::raw::c_char,
                       screenp: *mut ::std::os::raw::c_int)
     -> *mut xcb_connection_t;
}
extern "C" {
    /**
 * @brief Connects to the X server, using an authorization information.
 * @param display: The name of the display.
 * @param auth: The authorization information.
 * @param screen: A pointer to a preferred screen number.
 * @return A newly allocated xcb_connection_t structure.
 *
 * Connects to the X server specified by @p displayname, using the
 * authorization @p auth. If a particular screen on that server is
 * preferred, the int pointed to by @p screenp (if not @c NULL) will
 * be set to that screen; otherwise @p screenp will be set to 0.
 *
 * Always returns a non-NULL pointer to a xcb_connection_t, even on failure.
 * Callers need to use xcb_connection_has_error() to check for failure.
 * When finished, use xcb_disconnect() to close the connection and free
 * the structure.
 */
    pub fn xcb_connect_to_display_with_auth_info(display:
                                                     *const ::std::os::raw::c_char,
                                                 auth: *mut xcb_auth_info_t,
                                                 screen:
                                                     *mut ::std::os::raw::c_int)
     -> *mut xcb_connection_t;
}
extern "C" {
    /**
 * @brief Allocates an XID for a new object.
 * @param c: The connection.
 * @return A newly allocated XID.
 *
 * Allocates an XID for a new object. Typically used just prior to
 * various object creation functions, such as xcb_create_window.
 */
    pub fn xcb_generate_id(c: *mut xcb_connection_t) -> u32;
}
/**
 * @brief xcb_char2b_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_char2b_t {
    /**<  */
    pub byte1: u8,
    /**<  */
    pub byte2: u8,
}
#[test]
fn bindgen_test_layout_xcb_char2b_t() {
    assert_eq!(::std::mem::size_of::<xcb_char2b_t>() , 2usize , concat ! (
               "Size of: " , stringify ! ( xcb_char2b_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_char2b_t>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( xcb_char2b_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_char2b_t ) ) . byte1 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_char2b_t ) , "::" ,
                stringify ! ( byte1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_char2b_t ) ) . byte2 as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_char2b_t ) , "::" ,
                stringify ! ( byte2 ) ));
}
impl Clone for xcb_char2b_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_char2b_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_char2b_iterator_t {
    /**<  */
    pub data: *mut xcb_char2b_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_char2b_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_char2b_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_char2b_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_char2b_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_char2b_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_char2b_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_char2b_iterator_t )
                , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_char2b_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_char2b_iterator_t )
                , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_char2b_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_char2b_iterator_t )
                , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_char2b_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_window_t = u32;
/**
 * @brief xcb_window_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_window_iterator_t {
    /**<  */
    pub data: *mut xcb_window_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_window_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_window_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_window_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_window_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_window_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_window_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_window_iterator_t )
                , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_window_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_window_iterator_t )
                , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_window_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_window_iterator_t )
                , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_window_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_pixmap_t = u32;
/**
 * @brief xcb_pixmap_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_pixmap_iterator_t {
    /**<  */
    pub data: *mut xcb_pixmap_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_pixmap_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_pixmap_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_pixmap_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_pixmap_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_pixmap_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_pixmap_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_pixmap_iterator_t )
                , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_pixmap_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_pixmap_iterator_t )
                , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_pixmap_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_pixmap_iterator_t )
                , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_pixmap_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_cursor_t = u32;
/**
 * @brief xcb_cursor_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_cursor_iterator_t {
    /**<  */
    pub data: *mut xcb_cursor_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_cursor_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_cursor_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_cursor_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_cursor_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_cursor_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_cursor_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_cursor_iterator_t )
                , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_cursor_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_cursor_iterator_t )
                , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_cursor_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_cursor_iterator_t )
                , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_cursor_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_font_t = u32;
/**
 * @brief xcb_font_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_font_iterator_t {
    /**<  */
    pub data: *mut xcb_font_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_font_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_font_iterator_t>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( xcb_font_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_font_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_font_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_font_iterator_t ) ) . data as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_font_iterator_t ) ,
                "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_font_iterator_t ) ) . rem as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_font_iterator_t ) ,
                "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_font_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_font_iterator_t ) ,
                "::" , stringify ! ( index ) ));
}
impl Clone for xcb_font_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_gcontext_t = u32;
/**
 * @brief xcb_gcontext_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_gcontext_iterator_t {
    /**<  */
    pub data: *mut xcb_gcontext_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_gcontext_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_gcontext_iterator_t>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_gcontext_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_gcontext_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_gcontext_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_gcontext_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_gcontext_iterator_t
                ) , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_gcontext_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_gcontext_iterator_t
                ) , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_gcontext_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_gcontext_iterator_t
                ) , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_gcontext_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_colormap_t = u32;
/**
 * @brief xcb_colormap_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_colormap_iterator_t {
    /**<  */
    pub data: *mut xcb_colormap_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_colormap_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_colormap_iterator_t>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_colormap_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_colormap_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_colormap_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_colormap_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_colormap_iterator_t
                ) , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_colormap_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_colormap_iterator_t
                ) , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_colormap_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_colormap_iterator_t
                ) , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_colormap_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_atom_t = u32;
/**
 * @brief xcb_atom_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_atom_iterator_t {
    /**<  */
    pub data: *mut xcb_atom_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_atom_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_atom_iterator_t>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( xcb_atom_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_atom_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_atom_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_atom_iterator_t ) ) . data as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_atom_iterator_t ) ,
                "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_atom_iterator_t ) ) . rem as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_atom_iterator_t ) ,
                "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_atom_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_atom_iterator_t ) ,
                "::" , stringify ! ( index ) ));
}
impl Clone for xcb_atom_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_drawable_t = u32;
/**
 * @brief xcb_drawable_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_drawable_iterator_t {
    /**<  */
    pub data: *mut xcb_drawable_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_drawable_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_drawable_iterator_t>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_drawable_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_drawable_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_drawable_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_drawable_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_drawable_iterator_t
                ) , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_drawable_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_drawable_iterator_t
                ) , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_drawable_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_drawable_iterator_t
                ) , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_drawable_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_fontable_t = u32;
/**
 * @brief xcb_fontable_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_fontable_iterator_t {
    /**<  */
    pub data: *mut xcb_fontable_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_fontable_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_fontable_iterator_t>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_fontable_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_fontable_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_fontable_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_fontable_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_fontable_iterator_t
                ) , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_fontable_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_fontable_iterator_t
                ) , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_fontable_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_fontable_iterator_t
                ) , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_fontable_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_visualid_t = u32;
/**
 * @brief xcb_visualid_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_visualid_iterator_t {
    /**<  */
    pub data: *mut xcb_visualid_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_visualid_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_visualid_iterator_t>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_visualid_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_visualid_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_visualid_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualid_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_visualid_iterator_t
                ) , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualid_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_visualid_iterator_t
                ) , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualid_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_visualid_iterator_t
                ) , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_visualid_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_timestamp_t = u32;
/**
 * @brief xcb_timestamp_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_timestamp_iterator_t {
    /**<  */
    pub data: *mut xcb_timestamp_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_timestamp_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_timestamp_iterator_t>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_timestamp_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_timestamp_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_timestamp_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_timestamp_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_timestamp_iterator_t ) , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_timestamp_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_timestamp_iterator_t ) , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_timestamp_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_timestamp_iterator_t ) , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_timestamp_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_keysym_t = u32;
/**
 * @brief xcb_keysym_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_keysym_iterator_t {
    /**<  */
    pub data: *mut xcb_keysym_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_keysym_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_keysym_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_keysym_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_keysym_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_keysym_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_keysym_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_keysym_iterator_t )
                , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_keysym_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_keysym_iterator_t )
                , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_keysym_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_keysym_iterator_t )
                , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_keysym_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_keycode_t = u8;
/**
 * @brief xcb_keycode_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_keycode_iterator_t {
    /**<  */
    pub data: *mut xcb_keycode_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_keycode_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_keycode_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_keycode_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_keycode_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_keycode_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_keycode_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_keycode_iterator_t
                ) , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_keycode_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_keycode_iterator_t
                ) , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_keycode_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_keycode_iterator_t
                ) , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_keycode_iterator_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_button_t = u8;
/**
 * @brief xcb_button_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_button_iterator_t {
    /**<  */
    pub data: *mut xcb_button_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_button_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_button_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_button_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_button_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_button_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_button_iterator_t )
                , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_button_iterator_t )
                , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_button_iterator_t )
                , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_button_iterator_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_point_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_point_t {
    /**<  */
    pub x: i16,
    /**<  */
    pub y: i16,
}
#[test]
fn bindgen_test_layout_xcb_point_t() {
    assert_eq!(::std::mem::size_of::<xcb_point_t>() , 4usize , concat ! (
               "Size of: " , stringify ! ( xcb_point_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_point_t>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( xcb_point_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_point_t ) ) . x as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_point_t ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_point_t ) ) . y as * const _ as usize
                } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_point_t ) , "::" ,
                stringify ! ( y ) ));
}
impl Clone for xcb_point_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_point_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_point_iterator_t {
    /**<  */
    pub data: *mut xcb_point_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_point_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_point_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_point_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_point_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_point_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_point_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_point_iterator_t )
                , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_point_iterator_t ) ) . rem as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_point_iterator_t )
                , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_point_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_point_iterator_t )
                , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_point_iterator_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_rectangle_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_rectangle_t {
    /**<  */
    pub x: i16,
    /**<  */
    pub y: i16,
    /**<  */
    pub width: u16,
    /**<  */
    pub height: u16,
}
#[test]
fn bindgen_test_layout_xcb_rectangle_t() {
    assert_eq!(::std::mem::size_of::<xcb_rectangle_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( xcb_rectangle_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_rectangle_t>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( xcb_rectangle_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_rectangle_t ) ) . x as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_rectangle_t ) ,
                "::" , stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_rectangle_t ) ) . y as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_rectangle_t ) ,
                "::" , stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_rectangle_t ) ) . width as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_rectangle_t ) ,
                "::" , stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_rectangle_t ) ) . height as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_rectangle_t ) ,
                "::" , stringify ! ( height ) ));
}
impl Clone for xcb_rectangle_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_rectangle_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_rectangle_iterator_t {
    /**<  */
    pub data: *mut xcb_rectangle_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_rectangle_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_rectangle_iterator_t>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_rectangle_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_rectangle_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_rectangle_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_rectangle_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_rectangle_iterator_t ) , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_rectangle_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_rectangle_iterator_t ) , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_rectangle_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_rectangle_iterator_t ) , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_rectangle_iterator_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_arc_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_arc_t {
    /**<  */
    pub x: i16,
    /**<  */
    pub y: i16,
    /**<  */
    pub width: u16,
    /**<  */
    pub height: u16,
    /**<  */
    pub angle1: i16,
    /**<  */
    pub angle2: i16,
}
#[test]
fn bindgen_test_layout_xcb_arc_t() {
    assert_eq!(::std::mem::size_of::<xcb_arc_t>() , 12usize , concat ! (
               "Size of: " , stringify ! ( xcb_arc_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_arc_t>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( xcb_arc_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_arc_t ) ) . x as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_arc_t ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_arc_t ) ) . y as * const _ as usize }
                , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_arc_t ) , "::" ,
                stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_arc_t ) ) . width as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_arc_t ) , "::" ,
                stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_arc_t ) ) . height as * const _ as
                usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_arc_t ) , "::" ,
                stringify ! ( height ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_arc_t ) ) . angle1 as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_arc_t ) , "::" ,
                stringify ! ( angle1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_arc_t ) ) . angle2 as * const _ as
                usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_arc_t ) , "::" ,
                stringify ! ( angle2 ) ));
}
impl Clone for xcb_arc_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_arc_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_arc_iterator_t {
    /**<  */
    pub data: *mut xcb_arc_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_arc_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_arc_iterator_t>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( xcb_arc_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_arc_iterator_t>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( xcb_arc_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_arc_iterator_t ) ) . data as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_arc_iterator_t ) ,
                "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_arc_iterator_t ) ) . rem as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_arc_iterator_t ) ,
                "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_arc_iterator_t ) ) . index as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_arc_iterator_t ) ,
                "::" , stringify ! ( index ) ));
}
impl Clone for xcb_arc_iterator_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_format_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_format_t {
    /**<  */
    pub depth: u8,
    /**<  */
    pub bits_per_pixel: u8,
    /**<  */
    pub scanline_pad: u8,
    /**<  */
    pub pad0: [u8; 5usize],
}
#[test]
fn bindgen_test_layout_xcb_format_t() {
    assert_eq!(::std::mem::size_of::<xcb_format_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( xcb_format_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_format_t>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( xcb_format_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_format_t ) ) . depth as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_format_t ) , "::" ,
                stringify ! ( depth ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_format_t ) ) . bits_per_pixel as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_format_t ) , "::" ,
                stringify ! ( bits_per_pixel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_format_t ) ) . scanline_pad as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_format_t ) , "::" ,
                stringify ! ( scanline_pad ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_format_t ) ) . pad0 as * const _ as
                usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_format_t ) , "::" ,
                stringify ! ( pad0 ) ));
}
impl Clone for xcb_format_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_format_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_format_iterator_t {
    /**<  */
    pub data: *mut xcb_format_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_format_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_format_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_format_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_format_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_format_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_format_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_format_iterator_t )
                , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_format_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_format_iterator_t )
                , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_format_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_format_iterator_t )
                , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_format_iterator_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_visual_class_t {
    XCB_VISUAL_CLASS_STATIC_GRAY = 0,
    XCB_VISUAL_CLASS_GRAY_SCALE = 1,
    XCB_VISUAL_CLASS_STATIC_COLOR = 2,
    XCB_VISUAL_CLASS_PSEUDO_COLOR = 3,
    XCB_VISUAL_CLASS_TRUE_COLOR = 4,
    XCB_VISUAL_CLASS_DIRECT_COLOR = 5,
}
/**
 * @brief xcb_visualtype_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_visualtype_t {
    /**<  */
    pub visual_id: xcb_visualid_t,
    /**<  */
    pub _class: u8,
    /**<  */
    pub bits_per_rgb_value: u8,
    /**<  */
    pub colormap_entries: u16,
    /**<  */
    pub red_mask: u32,
    /**<  */
    pub green_mask: u32,
    /**<  */
    pub blue_mask: u32,
    /**<  */
    pub pad0: [u8; 4usize],
}
#[test]
fn bindgen_test_layout_xcb_visualtype_t() {
    assert_eq!(::std::mem::size_of::<xcb_visualtype_t>() , 24usize , concat !
               ( "Size of: " , stringify ! ( xcb_visualtype_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_visualtype_t>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( xcb_visualtype_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualtype_t ) ) . visual_id as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_visualtype_t ) ,
                "::" , stringify ! ( visual_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualtype_t ) ) . _class as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_visualtype_t ) ,
                "::" , stringify ! ( _class ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualtype_t ) ) . bits_per_rgb_value
                as * const _ as usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_visualtype_t ) ,
                "::" , stringify ! ( bits_per_rgb_value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualtype_t ) ) . colormap_entries
                as * const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_visualtype_t ) ,
                "::" , stringify ! ( colormap_entries ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualtype_t ) ) . red_mask as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_visualtype_t ) ,
                "::" , stringify ! ( red_mask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualtype_t ) ) . green_mask as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_visualtype_t ) ,
                "::" , stringify ! ( green_mask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualtype_t ) ) . blue_mask as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_visualtype_t ) ,
                "::" , stringify ! ( blue_mask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualtype_t ) ) . pad0 as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_visualtype_t ) ,
                "::" , stringify ! ( pad0 ) ));
}
impl Clone for xcb_visualtype_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_visualtype_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_visualtype_iterator_t {
    /**<  */
    pub data: *mut xcb_visualtype_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_visualtype_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_visualtype_iterator_t>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_visualtype_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_visualtype_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_visualtype_iterator_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualtype_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_visualtype_iterator_t ) , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualtype_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_visualtype_iterator_t ) , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visualtype_iterator_t ) ) . index as
                * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_visualtype_iterator_t ) , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_visualtype_iterator_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_depth_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_depth_t {
    /**<  */
    pub depth: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub visuals_len: u16,
    /**<  */
    pub pad1: [u8; 4usize],
}
#[test]
fn bindgen_test_layout_xcb_depth_t() {
    assert_eq!(::std::mem::size_of::<xcb_depth_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( xcb_depth_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_depth_t>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( xcb_depth_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_depth_t ) ) . depth as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_depth_t ) , "::" ,
                stringify ! ( depth ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_depth_t ) ) . pad0 as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_depth_t ) , "::" ,
                stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_depth_t ) ) . visuals_len as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_depth_t ) , "::" ,
                stringify ! ( visuals_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_depth_t ) ) . pad1 as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_depth_t ) , "::" ,
                stringify ! ( pad1 ) ));
}
impl Clone for xcb_depth_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_depth_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_depth_iterator_t {
    /**<  */
    pub data: *mut xcb_depth_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_depth_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_depth_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_depth_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_depth_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_depth_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_depth_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_depth_iterator_t )
                , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_depth_iterator_t ) ) . rem as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_depth_iterator_t )
                , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_depth_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_depth_iterator_t )
                , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_depth_iterator_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_event_mask_t {
    XCB_EVENT_MASK_NO_EVENT = 0,
    XCB_EVENT_MASK_KEY_PRESS = 1,
    XCB_EVENT_MASK_KEY_RELEASE = 2,
    XCB_EVENT_MASK_BUTTON_PRESS = 4,
    XCB_EVENT_MASK_BUTTON_RELEASE = 8,
    XCB_EVENT_MASK_ENTER_WINDOW = 16,
    XCB_EVENT_MASK_LEAVE_WINDOW = 32,
    XCB_EVENT_MASK_POINTER_MOTION = 64,
    XCB_EVENT_MASK_POINTER_MOTION_HINT = 128,
    XCB_EVENT_MASK_BUTTON_1_MOTION = 256,
    XCB_EVENT_MASK_BUTTON_2_MOTION = 512,
    XCB_EVENT_MASK_BUTTON_3_MOTION = 1024,
    XCB_EVENT_MASK_BUTTON_4_MOTION = 2048,
    XCB_EVENT_MASK_BUTTON_5_MOTION = 4096,
    XCB_EVENT_MASK_BUTTON_MOTION = 8192,
    XCB_EVENT_MASK_KEYMAP_STATE = 16384,
    XCB_EVENT_MASK_EXPOSURE = 32768,
    XCB_EVENT_MASK_VISIBILITY_CHANGE = 65536,
    XCB_EVENT_MASK_STRUCTURE_NOTIFY = 131072,
    XCB_EVENT_MASK_RESIZE_REDIRECT = 262144,
    XCB_EVENT_MASK_SUBSTRUCTURE_NOTIFY = 524288,
    XCB_EVENT_MASK_SUBSTRUCTURE_REDIRECT = 1048576,
    XCB_EVENT_MASK_FOCUS_CHANGE = 2097152,
    XCB_EVENT_MASK_PROPERTY_CHANGE = 4194304,
    XCB_EVENT_MASK_COLOR_MAP_CHANGE = 8388608,
    XCB_EVENT_MASK_OWNER_GRAB_BUTTON = 16777216,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_backing_store_t {
    XCB_BACKING_STORE_NOT_USEFUL = 0,
    XCB_BACKING_STORE_WHEN_MAPPED = 1,
    XCB_BACKING_STORE_ALWAYS = 2,
}
/**
 * @brief xcb_screen_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_screen_t {
    /**<  */
    pub root: xcb_window_t,
    /**<  */
    pub default_colormap: xcb_colormap_t,
    /**<  */
    pub white_pixel: u32,
    /**<  */
    pub black_pixel: u32,
    /**<  */
    pub current_input_masks: u32,
    /**<  */
    pub width_in_pixels: u16,
    /**<  */
    pub height_in_pixels: u16,
    /**<  */
    pub width_in_millimeters: u16,
    /**<  */
    pub height_in_millimeters: u16,
    /**<  */
    pub min_installed_maps: u16,
    /**<  */
    pub max_installed_maps: u16,
    /**<  */
    pub root_visual: xcb_visualid_t,
    /**<  */
    pub backing_stores: u8,
    /**<  */
    pub save_unders: u8,
    /**<  */
    pub root_depth: u8,
    /**<  */
    pub allowed_depths_len: u8,
}
#[test]
fn bindgen_test_layout_xcb_screen_t() {
    assert_eq!(::std::mem::size_of::<xcb_screen_t>() , 40usize , concat ! (
               "Size of: " , stringify ! ( xcb_screen_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_screen_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( xcb_screen_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . root as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( root ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . default_colormap as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( default_colormap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . white_pixel as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( white_pixel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . black_pixel as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( black_pixel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . current_input_masks as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( current_input_masks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . width_in_pixels as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( width_in_pixels ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . height_in_pixels as *
                const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( height_in_pixels ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . width_in_millimeters
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( width_in_millimeters ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . height_in_millimeters
                as * const _ as usize } , 26usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( height_in_millimeters ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . min_installed_maps as
                * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( min_installed_maps ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . max_installed_maps as
                * const _ as usize } , 30usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( max_installed_maps ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . root_visual as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( root_visual ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . backing_stores as *
                const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( backing_stores ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . save_unders as * const
                _ as usize } , 37usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( save_unders ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . root_depth as * const
                _ as usize } , 38usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( root_depth ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_t ) ) . allowed_depths_len as
                * const _ as usize } , 39usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_t ) , "::" ,
                stringify ! ( allowed_depths_len ) ));
}
impl Clone for xcb_screen_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_screen_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_screen_iterator_t {
    /**<  */
    pub data: *mut xcb_screen_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_screen_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_screen_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_screen_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_screen_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_screen_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_iterator_t )
                , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_iterator_t ) ) . rem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_iterator_t )
                , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_screen_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_screen_iterator_t )
                , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_screen_iterator_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_setup_request_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_setup_request_t {
    /**<  */
    pub byte_order: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub protocol_major_version: u16,
    /**<  */
    pub protocol_minor_version: u16,
    /**<  */
    pub authorization_protocol_name_len: u16,
    /**<  */
    pub authorization_protocol_data_len: u16,
    /**<  */
    pub pad1: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_xcb_setup_request_t() {
    assert_eq!(::std::mem::size_of::<xcb_setup_request_t>() , 12usize , concat
               ! ( "Size of: " , stringify ! ( xcb_setup_request_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_setup_request_t>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_setup_request_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_request_t ) ) . byte_order as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_request_t ) ,
                "::" , stringify ! ( byte_order ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_request_t ) ) . pad0 as * const
                _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_request_t ) ,
                "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_request_t ) ) .
                protocol_major_version as * const _ as usize } , 2usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_request_t ) ,
                "::" , stringify ! ( protocol_major_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_request_t ) ) .
                protocol_minor_version as * const _ as usize } , 4usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_request_t ) ,
                "::" , stringify ! ( protocol_minor_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_request_t ) ) .
                authorization_protocol_name_len as * const _ as usize } ,
                6usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_request_t ) ,
                "::" , stringify ! ( authorization_protocol_name_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_request_t ) ) .
                authorization_protocol_data_len as * const _ as usize } ,
                8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_request_t ) ,
                "::" , stringify ! ( authorization_protocol_data_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_request_t ) ) . pad1 as * const
                _ as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_request_t ) ,
                "::" , stringify ! ( pad1 ) ));
}
impl Clone for xcb_setup_request_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_setup_request_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_setup_request_iterator_t {
    /**<  */
    pub data: *mut xcb_setup_request_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_setup_request_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_setup_request_iterator_t>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( xcb_setup_request_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_setup_request_iterator_t>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( xcb_setup_request_iterator_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_request_iterator_t ) ) . data
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_request_iterator_t ) , "::" , stringify ! ( data )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_request_iterator_t ) ) . rem as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_request_iterator_t ) , "::" , stringify ! ( rem )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_request_iterator_t ) ) . index
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_request_iterator_t ) , "::" , stringify ! ( index )
                ));
}
impl Clone for xcb_setup_request_iterator_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_setup_failed_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_setup_failed_t {
    /**<  */
    pub status: u8,
    /**<  */
    pub reason_len: u8,
    /**<  */
    pub protocol_major_version: u16,
    /**<  */
    pub protocol_minor_version: u16,
    /**<  */
    pub length: u16,
}
#[test]
fn bindgen_test_layout_xcb_setup_failed_t() {
    assert_eq!(::std::mem::size_of::<xcb_setup_failed_t>() , 8usize , concat !
               ( "Size of: " , stringify ! ( xcb_setup_failed_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_setup_failed_t>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( xcb_setup_failed_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_failed_t ) ) . status as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_failed_t ) ,
                "::" , stringify ! ( status ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_failed_t ) ) . reason_len as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_failed_t ) ,
                "::" , stringify ! ( reason_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_failed_t ) ) .
                protocol_major_version as * const _ as usize } , 2usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_failed_t ) ,
                "::" , stringify ! ( protocol_major_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_failed_t ) ) .
                protocol_minor_version as * const _ as usize } , 4usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_failed_t ) ,
                "::" , stringify ! ( protocol_minor_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_failed_t ) ) . length as *
                const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_failed_t ) ,
                "::" , stringify ! ( length ) ));
}
impl Clone for xcb_setup_failed_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_setup_failed_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_setup_failed_iterator_t {
    /**<  */
    pub data: *mut xcb_setup_failed_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_setup_failed_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_setup_failed_iterator_t>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( xcb_setup_failed_iterator_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_setup_failed_iterator_t>() , 8usize
                , concat ! (
                "Alignment of " , stringify ! ( xcb_setup_failed_iterator_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_failed_iterator_t ) ) . data as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_failed_iterator_t ) , "::" , stringify ! ( data )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_failed_iterator_t ) ) . rem as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_failed_iterator_t ) , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_failed_iterator_t ) ) . index
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_failed_iterator_t ) , "::" , stringify ! ( index )
                ));
}
impl Clone for xcb_setup_failed_iterator_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_setup_authenticate_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_setup_authenticate_t {
    /**<  */
    pub status: u8,
    /**<  */
    pub pad0: [u8; 5usize],
    /**<  */
    pub length: u16,
}
#[test]
fn bindgen_test_layout_xcb_setup_authenticate_t() {
    assert_eq!(::std::mem::size_of::<xcb_setup_authenticate_t>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_setup_authenticate_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_setup_authenticate_t>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_setup_authenticate_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_authenticate_t ) ) . status as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_authenticate_t ) , "::" , stringify ! ( status ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_authenticate_t ) ) . pad0 as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_authenticate_t ) , "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_authenticate_t ) ) . length as
                * const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_authenticate_t ) , "::" , stringify ! ( length ) ));
}
impl Clone for xcb_setup_authenticate_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_setup_authenticate_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_setup_authenticate_iterator_t {
    /**<  */
    pub data: *mut xcb_setup_authenticate_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_setup_authenticate_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_setup_authenticate_iterator_t>() ,
               16usize , concat ! (
               "Size of: " , stringify ! ( xcb_setup_authenticate_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_setup_authenticate_iterator_t>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                xcb_setup_authenticate_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_authenticate_iterator_t ) ) .
                data as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_authenticate_iterator_t ) , "::" , stringify ! (
                data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_authenticate_iterator_t ) ) .
                rem as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_authenticate_iterator_t ) , "::" , stringify ! ( rem
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_authenticate_iterator_t ) ) .
                index as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_setup_authenticate_iterator_t ) , "::" , stringify ! (
                index ) ));
}
impl Clone for xcb_setup_authenticate_iterator_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_image_order_t {
    XCB_IMAGE_ORDER_LSB_FIRST = 0,
    XCB_IMAGE_ORDER_MSB_FIRST = 1,
}
/**
 * @brief xcb_setup_iterator_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_setup_iterator_t {
    /**<  */
    pub data: *mut xcb_setup_t,
    /**<  */
    pub rem: ::std::os::raw::c_int,
    /**<  */
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_xcb_setup_iterator_t() {
    assert_eq!(::std::mem::size_of::<xcb_setup_iterator_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_setup_iterator_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_setup_iterator_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_setup_iterator_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_iterator_t ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_iterator_t )
                , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_iterator_t ) ) . rem as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_iterator_t )
                , "::" , stringify ! ( rem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_setup_iterator_t ) ) . index as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_setup_iterator_t )
                , "::" , stringify ! ( index ) ));
}
impl Clone for xcb_setup_iterator_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_mod_mask_t {
    XCB_MOD_MASK_SHIFT = 1,
    XCB_MOD_MASK_LOCK = 2,
    XCB_MOD_MASK_CONTROL = 4,
    XCB_MOD_MASK_1 = 8,
    XCB_MOD_MASK_2 = 16,
    XCB_MOD_MASK_3 = 32,
    XCB_MOD_MASK_4 = 64,
    XCB_MOD_MASK_5 = 128,
    XCB_MOD_MASK_ANY = 32768,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_key_but_mask_t {
    XCB_KEY_BUT_MASK_SHIFT = 1,
    XCB_KEY_BUT_MASK_LOCK = 2,
    XCB_KEY_BUT_MASK_CONTROL = 4,
    XCB_KEY_BUT_MASK_MOD_1 = 8,
    XCB_KEY_BUT_MASK_MOD_2 = 16,
    XCB_KEY_BUT_MASK_MOD_3 = 32,
    XCB_KEY_BUT_MASK_MOD_4 = 64,
    XCB_KEY_BUT_MASK_MOD_5 = 128,
    XCB_KEY_BUT_MASK_BUTTON_1 = 256,
    XCB_KEY_BUT_MASK_BUTTON_2 = 512,
    XCB_KEY_BUT_MASK_BUTTON_3 = 1024,
    XCB_KEY_BUT_MASK_BUTTON_4 = 2048,
    XCB_KEY_BUT_MASK_BUTTON_5 = 4096,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_window_enum_t { XCB_WINDOW_NONE = 0, }
/**
 * @brief xcb_key_press_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_key_press_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub detail: xcb_keycode_t,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub time: xcb_timestamp_t,
    /**<  */
    pub root: xcb_window_t,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub child: xcb_window_t,
    /**<  */
    pub root_x: i16,
    /**<  */
    pub root_y: i16,
    /**<  */
    pub event_x: i16,
    /**<  */
    pub event_y: i16,
    /**<  */
    pub state: u16,
    /**<  */
    pub same_screen: u8,
    /**<  */
    pub pad0: u8,
}
#[test]
fn bindgen_test_layout_xcb_key_press_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_key_press_event_t>() , 32usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_key_press_event_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_key_press_event_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_key_press_event_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . response_type
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . detail as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( detail ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . sequence as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . time as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . root as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( root ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . event as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( event ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . child as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( child ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . root_x as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( root_x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . root_y as *
                const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( root_y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . event_x as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( event_x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . event_y as *
                const _ as usize } , 26usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( event_y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . state as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . same_screen
                as * const _ as usize } , 30usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( same_screen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_key_press_event_t ) ) . pad0 as *
                const _ as usize } , 31usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_key_press_event_t )
                , "::" , stringify ! ( pad0 ) ));
}
impl Clone for xcb_key_press_event_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_key_release_event_t = xcb_key_press_event_t;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_button_mask_t {
    XCB_BUTTON_MASK_1 = 256,
    XCB_BUTTON_MASK_2 = 512,
    XCB_BUTTON_MASK_3 = 1024,
    XCB_BUTTON_MASK_4 = 2048,
    XCB_BUTTON_MASK_5 = 4096,
    XCB_BUTTON_MASK_ANY = 32768,
}
/**
 * @brief xcb_button_press_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_button_press_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub detail: xcb_button_t,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub time: xcb_timestamp_t,
    /**<  */
    pub root: xcb_window_t,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub child: xcb_window_t,
    /**<  */
    pub root_x: i16,
    /**<  */
    pub root_y: i16,
    /**<  */
    pub event_x: i16,
    /**<  */
    pub event_y: i16,
    /**<  */
    pub state: u16,
    /**<  */
    pub same_screen: u8,
    /**<  */
    pub pad0: u8,
}
#[test]
fn bindgen_test_layout_xcb_button_press_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_button_press_event_t>() , 32usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_button_press_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_button_press_event_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_button_press_event_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . detail as
                * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( detail ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . sequence
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( sequence )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . time as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . root as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( root ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . event as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( event ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . child as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( child ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . root_x as
                * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( root_x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . root_y as
                * const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( root_y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . event_x as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( event_x )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . event_y as
                * const _ as usize } , 26usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( event_y )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . state as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) .
                same_screen as * const _ as usize } , 30usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( same_screen
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_button_press_event_t ) ) . pad0 as *
                const _ as usize } , 31usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_button_press_event_t ) , "::" , stringify ! ( pad0 ) ));
}
impl Clone for xcb_button_press_event_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_button_release_event_t = xcb_button_press_event_t;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_motion_t { XCB_MOTION_NORMAL = 0, XCB_MOTION_HINT = 1, }
/**
 * @brief xcb_motion_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_motion_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub detail: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub time: xcb_timestamp_t,
    /**<  */
    pub root: xcb_window_t,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub child: xcb_window_t,
    /**<  */
    pub root_x: i16,
    /**<  */
    pub root_y: i16,
    /**<  */
    pub event_x: i16,
    /**<  */
    pub event_y: i16,
    /**<  */
    pub state: u16,
    /**<  */
    pub same_screen: u8,
    /**<  */
    pub pad0: u8,
}
#[test]
fn bindgen_test_layout_xcb_motion_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_motion_notify_event_t>() , 32usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_motion_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_motion_notify_event_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_motion_notify_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . detail as
                * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( detail )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . sequence
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( sequence )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . time as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . root as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( root ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . event as
                * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( event ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . child as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( child ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . root_x as
                * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( root_x )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . root_y as
                * const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( root_y )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . event_x
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( event_x )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . event_y
                as * const _ as usize } , 26usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( event_y )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . state as
                * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) .
                same_screen as * const _ as usize } , 30usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( same_screen
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_motion_notify_event_t ) ) . pad0 as *
                const _ as usize } , 31usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_motion_notify_event_t ) , "::" , stringify ! ( pad0 ) ));
}
impl Clone for xcb_motion_notify_event_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_notify_detail_t {
    XCB_NOTIFY_DETAIL_ANCESTOR = 0,
    XCB_NOTIFY_DETAIL_VIRTUAL = 1,
    XCB_NOTIFY_DETAIL_INFERIOR = 2,
    XCB_NOTIFY_DETAIL_NONLINEAR = 3,
    XCB_NOTIFY_DETAIL_NONLINEAR_VIRTUAL = 4,
    XCB_NOTIFY_DETAIL_POINTER = 5,
    XCB_NOTIFY_DETAIL_POINTER_ROOT = 6,
    XCB_NOTIFY_DETAIL_NONE = 7,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_notify_mode_t {
    XCB_NOTIFY_MODE_NORMAL = 0,
    XCB_NOTIFY_MODE_GRAB = 1,
    XCB_NOTIFY_MODE_UNGRAB = 2,
    XCB_NOTIFY_MODE_WHILE_GRABBED = 3,
}
/**
 * @brief xcb_enter_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_enter_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub detail: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub time: xcb_timestamp_t,
    /**<  */
    pub root: xcb_window_t,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub child: xcb_window_t,
    /**<  */
    pub root_x: i16,
    /**<  */
    pub root_y: i16,
    /**<  */
    pub event_x: i16,
    /**<  */
    pub event_y: i16,
    /**<  */
    pub state: u16,
    /**<  */
    pub mode: u8,
    /**<  */
    pub same_screen_focus: u8,
}
#[test]
fn bindgen_test_layout_xcb_enter_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_enter_notify_event_t>() , 32usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_enter_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_enter_notify_event_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_enter_notify_event_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . detail as
                * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( detail ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . sequence
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( sequence )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . time as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . root as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( root ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . event as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( event ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . child as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( child ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . root_x as
                * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( root_x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . root_y as
                * const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( root_y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . event_x as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( event_x )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . event_y as
                * const _ as usize } , 26usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( event_y )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . state as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) . mode as *
                const _ as usize } , 30usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! ( mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_enter_notify_event_t ) ) .
                same_screen_focus as * const _ as usize } , 31usize , concat !
                (
                "Alignment of field: " , stringify ! (
                xcb_enter_notify_event_t ) , "::" , stringify ! (
                same_screen_focus ) ));
}
impl Clone for xcb_enter_notify_event_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_leave_notify_event_t = xcb_enter_notify_event_t;
/**
 * @brief xcb_focus_in_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_focus_in_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub detail: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub mode: u8,
    /**<  */
    pub pad0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_xcb_focus_in_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_focus_in_event_t>() , 12usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_focus_in_event_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_focus_in_event_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_focus_in_event_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_focus_in_event_t ) ) . response_type
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_focus_in_event_t )
                , "::" , stringify ! ( response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_focus_in_event_t ) ) . detail as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_focus_in_event_t )
                , "::" , stringify ! ( detail ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_focus_in_event_t ) ) . sequence as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_focus_in_event_t )
                , "::" , stringify ! ( sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_focus_in_event_t ) ) . event as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_focus_in_event_t )
                , "::" , stringify ! ( event ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_focus_in_event_t ) ) . mode as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_focus_in_event_t )
                , "::" , stringify ! ( mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_focus_in_event_t ) ) . pad0 as *
                const _ as usize } , 9usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_focus_in_event_t )
                , "::" , stringify ! ( pad0 ) ));
}
impl Clone for xcb_focus_in_event_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_focus_out_event_t = xcb_focus_in_event_t;
/**
 * @brief xcb_keymap_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_keymap_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub keys: [u8; 31usize],
}
#[test]
fn bindgen_test_layout_xcb_keymap_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_keymap_notify_event_t>() , 32usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_keymap_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_keymap_notify_event_t>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_keymap_notify_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_keymap_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_keymap_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_keymap_notify_event_t ) ) . keys as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_keymap_notify_event_t ) , "::" , stringify ! ( keys ) ));
}
impl Clone for xcb_keymap_notify_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_expose_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_expose_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub x: u16,
    /**<  */
    pub y: u16,
    /**<  */
    pub width: u16,
    /**<  */
    pub height: u16,
    /**<  */
    pub count: u16,
    /**<  */
    pub pad1: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_xcb_expose_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_expose_event_t>() , 20usize , concat
               ! ( "Size of: " , stringify ! ( xcb_expose_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_expose_event_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( xcb_expose_event_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_expose_event_t ) ) . response_type as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_expose_event_t ) ,
                "::" , stringify ! ( response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_expose_event_t ) ) . pad0 as * const
                _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_expose_event_t ) ,
                "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_expose_event_t ) ) . sequence as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_expose_event_t ) ,
                "::" , stringify ! ( sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_expose_event_t ) ) . window as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_expose_event_t ) ,
                "::" , stringify ! ( window ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_expose_event_t ) ) . x as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_expose_event_t ) ,
                "::" , stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_expose_event_t ) ) . y as * const _
                as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_expose_event_t ) ,
                "::" , stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_expose_event_t ) ) . width as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_expose_event_t ) ,
                "::" , stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_expose_event_t ) ) . height as *
                const _ as usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_expose_event_t ) ,
                "::" , stringify ! ( height ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_expose_event_t ) ) . count as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_expose_event_t ) ,
                "::" , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_expose_event_t ) ) . pad1 as * const
                _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_expose_event_t ) ,
                "::" , stringify ! ( pad1 ) ));
}
impl Clone for xcb_expose_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_graphics_exposure_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_graphics_exposure_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub drawable: xcb_drawable_t,
    /**<  */
    pub x: u16,
    /**<  */
    pub y: u16,
    /**<  */
    pub width: u16,
    /**<  */
    pub height: u16,
    /**<  */
    pub minor_opcode: u16,
    /**<  */
    pub count: u16,
    /**<  */
    pub major_opcode: u8,
    /**<  */
    pub pad1: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_xcb_graphics_exposure_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_graphics_exposure_event_t>() ,
               24usize , concat ! (
               "Size of: " , stringify ! ( xcb_graphics_exposure_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_graphics_exposure_event_t>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( xcb_graphics_exposure_event_t
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) . pad0
                as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! ( pad0 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! (
                sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) .
                drawable as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! (
                drawable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) . x as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) . y as
                * const _ as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) . width
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! ( width )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) .
                height as * const _ as usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! ( height
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) .
                minor_opcode as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! (
                minor_opcode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) . count
                as * const _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! ( count )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) .
                major_opcode as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! (
                major_opcode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_graphics_exposure_event_t ) ) . pad1
                as * const _ as usize } , 21usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_graphics_exposure_event_t ) , "::" , stringify ! ( pad1 )
                ));
}
impl Clone for xcb_graphics_exposure_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_no_exposure_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_no_exposure_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub drawable: xcb_drawable_t,
    /**<  */
    pub minor_opcode: u16,
    /**<  */
    pub major_opcode: u8,
    /**<  */
    pub pad1: u8,
}
#[test]
fn bindgen_test_layout_xcb_no_exposure_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_no_exposure_event_t>() , 12usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_no_exposure_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_no_exposure_event_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_no_exposure_event_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_no_exposure_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_no_exposure_event_t
                ) , "::" , stringify ! ( response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_no_exposure_event_t ) ) . pad0 as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_no_exposure_event_t
                ) , "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_no_exposure_event_t ) ) . sequence as
                * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_no_exposure_event_t
                ) , "::" , stringify ! ( sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_no_exposure_event_t ) ) . drawable as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_no_exposure_event_t
                ) , "::" , stringify ! ( drawable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_no_exposure_event_t ) ) .
                minor_opcode as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_no_exposure_event_t
                ) , "::" , stringify ! ( minor_opcode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_no_exposure_event_t ) ) .
                major_opcode as * const _ as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_no_exposure_event_t
                ) , "::" , stringify ! ( major_opcode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_no_exposure_event_t ) ) . pad1 as *
                const _ as usize } , 11usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_no_exposure_event_t
                ) , "::" , stringify ! ( pad1 ) ));
}
impl Clone for xcb_no_exposure_event_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_visibility_t {
    XCB_VISIBILITY_UNOBSCURED = 0,
    XCB_VISIBILITY_PARTIALLY_OBSCURED = 1,
    XCB_VISIBILITY_FULLY_OBSCURED = 2,
}
/**
 * @brief xcb_visibility_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_visibility_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub state: u8,
    /**<  */
    pub pad1: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_xcb_visibility_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_visibility_notify_event_t>() ,
               12usize , concat ! (
               "Size of: " , stringify ! ( xcb_visibility_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_visibility_notify_event_t>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( xcb_visibility_notify_event_t
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visibility_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_visibility_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visibility_notify_event_t ) ) . pad0
                as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_visibility_notify_event_t ) , "::" , stringify ! ( pad0 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visibility_notify_event_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_visibility_notify_event_t ) , "::" , stringify ! (
                sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visibility_notify_event_t ) ) .
                window as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_visibility_notify_event_t ) , "::" , stringify ! ( window
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visibility_notify_event_t ) ) . state
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_visibility_notify_event_t ) , "::" , stringify ! ( state )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_visibility_notify_event_t ) ) . pad1
                as * const _ as usize } , 9usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_visibility_notify_event_t ) , "::" , stringify ! ( pad1 )
                ));
}
impl Clone for xcb_visibility_notify_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_create_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_create_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub parent: xcb_window_t,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub x: i16,
    /**<  */
    pub y: i16,
    /**<  */
    pub width: u16,
    /**<  */
    pub height: u16,
    /**<  */
    pub border_width: u16,
    /**<  */
    pub override_redirect: u8,
    /**<  */
    pub pad1: u8,
}
#[test]
fn bindgen_test_layout_xcb_create_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_create_notify_event_t>() , 24usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_create_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_create_notify_event_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_create_notify_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) . pad0 as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) . sequence
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! ( sequence )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) . parent as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! ( parent )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) . window as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! ( window )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) . x as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) . y as *
                const _ as usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) . width as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) . height as
                * const _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! ( height )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) .
                border_width as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! (
                border_width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) .
                override_redirect as * const _ as usize } , 22usize , concat !
                (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! (
                override_redirect ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_create_notify_event_t ) ) . pad1 as *
                const _ as usize } , 23usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_create_notify_event_t ) , "::" , stringify ! ( pad1 ) ));
}
impl Clone for xcb_create_notify_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_destroy_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_destroy_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub window: xcb_window_t,
}
#[test]
fn bindgen_test_layout_xcb_destroy_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_destroy_notify_event_t>() , 12usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_destroy_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_destroy_notify_event_t>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( xcb_destroy_notify_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_destroy_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_destroy_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_destroy_notify_event_t ) ) . pad0 as
                * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_destroy_notify_event_t ) , "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_destroy_notify_event_t ) ) . sequence
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_destroy_notify_event_t ) , "::" , stringify ! ( sequence )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_destroy_notify_event_t ) ) . event as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_destroy_notify_event_t ) , "::" , stringify ! ( event )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_destroy_notify_event_t ) ) . window
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_destroy_notify_event_t ) , "::" , stringify ! ( window )
                ));
}
impl Clone for xcb_destroy_notify_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_unmap_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_unmap_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub from_configure: u8,
    /**<  */
    pub pad1: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_xcb_unmap_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_unmap_notify_event_t>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_unmap_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_unmap_notify_event_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_unmap_notify_event_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_unmap_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_unmap_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_unmap_notify_event_t ) ) . pad0 as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_unmap_notify_event_t ) , "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_unmap_notify_event_t ) ) . sequence
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_unmap_notify_event_t ) , "::" , stringify ! ( sequence )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_unmap_notify_event_t ) ) . event as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_unmap_notify_event_t ) , "::" , stringify ! ( event ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_unmap_notify_event_t ) ) . window as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_unmap_notify_event_t ) , "::" , stringify ! ( window ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_unmap_notify_event_t ) ) .
                from_configure as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_unmap_notify_event_t ) , "::" , stringify ! (
                from_configure ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_unmap_notify_event_t ) ) . pad1 as *
                const _ as usize } , 13usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_unmap_notify_event_t ) , "::" , stringify ! ( pad1 ) ));
}
impl Clone for xcb_unmap_notify_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_map_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_map_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub override_redirect: u8,
    /**<  */
    pub pad1: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_xcb_map_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_map_notify_event_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( xcb_map_notify_event_t )
               ));
    assert_eq! (::std::mem::align_of::<xcb_map_notify_event_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_map_notify_event_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_map_notify_event_t
                ) , "::" , stringify ! ( response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_notify_event_t ) ) . pad0 as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_map_notify_event_t
                ) , "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_notify_event_t ) ) . sequence as
                * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_map_notify_event_t
                ) , "::" , stringify ! ( sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_notify_event_t ) ) . event as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_map_notify_event_t
                ) , "::" , stringify ! ( event ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_notify_event_t ) ) . window as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_map_notify_event_t
                ) , "::" , stringify ! ( window ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_notify_event_t ) ) .
                override_redirect as * const _ as usize } , 12usize , concat !
                (
                "Alignment of field: " , stringify ! ( xcb_map_notify_event_t
                ) , "::" , stringify ! ( override_redirect ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_notify_event_t ) ) . pad1 as *
                const _ as usize } , 13usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_map_notify_event_t
                ) , "::" , stringify ! ( pad1 ) ));
}
impl Clone for xcb_map_notify_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_map_request_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_map_request_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub parent: xcb_window_t,
    /**<  */
    pub window: xcb_window_t,
}
#[test]
fn bindgen_test_layout_xcb_map_request_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_map_request_event_t>() , 12usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_map_request_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_map_request_event_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xcb_map_request_event_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_request_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_map_request_event_t
                ) , "::" , stringify ! ( response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_request_event_t ) ) . pad0 as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_map_request_event_t
                ) , "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_request_event_t ) ) . sequence as
                * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_map_request_event_t
                ) , "::" , stringify ! ( sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_request_event_t ) ) . parent as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_map_request_event_t
                ) , "::" , stringify ! ( parent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_map_request_event_t ) ) . window as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( xcb_map_request_event_t
                ) , "::" , stringify ! ( window ) ));
}
impl Clone for xcb_map_request_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_reparent_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_reparent_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub parent: xcb_window_t,
    /**<  */
    pub x: i16,
    /**<  */
    pub y: i16,
    /**<  */
    pub override_redirect: u8,
    /**<  */
    pub pad1: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_xcb_reparent_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_reparent_notify_event_t>() , 24usize
               , concat ! (
               "Size of: " , stringify ! ( xcb_reparent_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_reparent_notify_event_t>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( xcb_reparent_notify_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_reparent_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_reparent_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_reparent_notify_event_t ) ) . pad0 as
                * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_reparent_notify_event_t ) , "::" , stringify ! ( pad0 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_reparent_notify_event_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_reparent_notify_event_t ) , "::" , stringify ! ( sequence
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_reparent_notify_event_t ) ) . event
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_reparent_notify_event_t ) , "::" , stringify ! ( event )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_reparent_notify_event_t ) ) . window
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_reparent_notify_event_t ) , "::" , stringify ! ( window )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_reparent_notify_event_t ) ) . parent
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_reparent_notify_event_t ) , "::" , stringify ! ( parent )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_reparent_notify_event_t ) ) . x as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_reparent_notify_event_t ) , "::" , stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_reparent_notify_event_t ) ) . y as *
                const _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_reparent_notify_event_t ) , "::" , stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_reparent_notify_event_t ) ) .
                override_redirect as * const _ as usize } , 20usize , concat !
                (
                "Alignment of field: " , stringify ! (
                xcb_reparent_notify_event_t ) , "::" , stringify ! (
                override_redirect ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_reparent_notify_event_t ) ) . pad1 as
                * const _ as usize } , 21usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_reparent_notify_event_t ) , "::" , stringify ! ( pad1 )
                ));
}
impl Clone for xcb_reparent_notify_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_configure_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_configure_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub above_sibling: xcb_window_t,
    /**<  */
    pub x: i16,
    /**<  */
    pub y: i16,
    /**<  */
    pub width: u16,
    /**<  */
    pub height: u16,
    /**<  */
    pub border_width: u16,
    /**<  */
    pub override_redirect: u8,
    /**<  */
    pub pad1: u8,
}
#[test]
fn bindgen_test_layout_xcb_configure_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_configure_notify_event_t>() , 28usize
               , concat ! (
               "Size of: " , stringify ! ( xcb_configure_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_configure_notify_event_t>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( xcb_configure_notify_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) . pad0
                as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! ( pad0 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! ( sequence
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) . event
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! ( event )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) . window
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! ( window )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) .
                above_sibling as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! (
                above_sibling ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) . x as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) . y as *
                const _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) . width
                as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! ( width )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) . height
                as * const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! ( height )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) .
                border_width as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! (
                border_width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) .
                override_redirect as * const _ as usize } , 26usize , concat !
                (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! (
                override_redirect ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_notify_event_t ) ) . pad1
                as * const _ as usize } , 27usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_notify_event_t ) , "::" , stringify ! ( pad1 )
                ));
}
impl Clone for xcb_configure_notify_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_configure_request_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_configure_request_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub stack_mode: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub parent: xcb_window_t,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub sibling: xcb_window_t,
    /**<  */
    pub x: i16,
    /**<  */
    pub y: i16,
    /**<  */
    pub width: u16,
    /**<  */
    pub height: u16,
    /**<  */
    pub border_width: u16,
    /**<  */
    pub value_mask: u16,
}
#[test]
fn bindgen_test_layout_xcb_configure_request_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_configure_request_event_t>() ,
               28usize , concat ! (
               "Size of: " , stringify ! ( xcb_configure_request_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_configure_request_event_t>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( xcb_configure_request_event_t
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) .
                stack_mode as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! (
                stack_mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! (
                sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) .
                parent as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! ( parent
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) .
                window as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! ( window
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) .
                sibling as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! ( sibling
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) . x as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) . y as
                * const _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) . width
                as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! ( width )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) .
                height as * const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! ( height
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) .
                border_width as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! (
                border_width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_configure_request_event_t ) ) .
                value_mask as * const _ as usize } , 26usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_configure_request_event_t ) , "::" , stringify ! (
                value_mask ) ));
}
impl Clone for xcb_configure_request_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_gravity_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_gravity_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub x: i16,
    /**<  */
    pub y: i16,
}
#[test]
fn bindgen_test_layout_xcb_gravity_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_gravity_notify_event_t>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_gravity_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_gravity_notify_event_t>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( xcb_gravity_notify_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_gravity_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_gravity_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_gravity_notify_event_t ) ) . pad0 as
                * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_gravity_notify_event_t ) , "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_gravity_notify_event_t ) ) . sequence
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_gravity_notify_event_t ) , "::" , stringify ! ( sequence )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_gravity_notify_event_t ) ) . event as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_gravity_notify_event_t ) , "::" , stringify ! ( event )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_gravity_notify_event_t ) ) . window
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_gravity_notify_event_t ) , "::" , stringify ! ( window )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_gravity_notify_event_t ) ) . x as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_gravity_notify_event_t ) , "::" , stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_gravity_notify_event_t ) ) . y as *
                const _ as usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_gravity_notify_event_t ) , "::" , stringify ! ( y ) ));
}
impl Clone for xcb_gravity_notify_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_resize_request_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_resize_request_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub width: u16,
    /**<  */
    pub height: u16,
}
#[test]
fn bindgen_test_layout_xcb_resize_request_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_resize_request_event_t>() , 12usize ,
               concat ! (
               "Size of: " , stringify ! ( xcb_resize_request_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_resize_request_event_t>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( xcb_resize_request_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_resize_request_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_resize_request_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_resize_request_event_t ) ) . pad0 as
                * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_resize_request_event_t ) , "::" , stringify ! ( pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_resize_request_event_t ) ) . sequence
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_resize_request_event_t ) , "::" , stringify ! ( sequence )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_resize_request_event_t ) ) . window
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_resize_request_event_t ) , "::" , stringify ! ( window )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_resize_request_event_t ) ) . width as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_resize_request_event_t ) , "::" , stringify ! ( width )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_resize_request_event_t ) ) . height
                as * const _ as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_resize_request_event_t ) , "::" , stringify ! ( height )
                ));
}
impl Clone for xcb_resize_request_event_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_place_t { XCB_PLACE_ON_TOP = 0, XCB_PLACE_ON_BOTTOM = 1, }
/**
 * @brief xcb_circulate_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_circulate_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub event: xcb_window_t,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub pad1: [u8; 4usize],
    /**<  */
    pub place: u8,
    /**<  */
    pub pad2: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_xcb_circulate_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_circulate_notify_event_t>() , 20usize
               , concat ! (
               "Size of: " , stringify ! ( xcb_circulate_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_circulate_notify_event_t>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( xcb_circulate_notify_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_circulate_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_circulate_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_circulate_notify_event_t ) ) . pad0
                as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_circulate_notify_event_t ) , "::" , stringify ! ( pad0 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_circulate_notify_event_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_circulate_notify_event_t ) , "::" , stringify ! ( sequence
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_circulate_notify_event_t ) ) . event
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_circulate_notify_event_t ) , "::" , stringify ! ( event )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_circulate_notify_event_t ) ) . window
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_circulate_notify_event_t ) , "::" , stringify ! ( window )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_circulate_notify_event_t ) ) . pad1
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_circulate_notify_event_t ) , "::" , stringify ! ( pad1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_circulate_notify_event_t ) ) . place
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_circulate_notify_event_t ) , "::" , stringify ! ( place )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_circulate_notify_event_t ) ) . pad2
                as * const _ as usize } , 17usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_circulate_notify_event_t ) , "::" , stringify ! ( pad2 )
                ));
}
impl Clone for xcb_circulate_notify_event_t {
    fn clone(&self) -> Self { *self }
}
pub type xcb_circulate_request_event_t = xcb_circulate_notify_event_t;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_property_t {
    XCB_PROPERTY_NEW_VALUE = 0,
    XCB_PROPERTY_DELETE = 1,
}
/**
 * @brief xcb_property_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_property_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub atom: xcb_atom_t,
    /**<  */
    pub time: xcb_timestamp_t,
    /**<  */
    pub state: u8,
    /**<  */
    pub pad1: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_xcb_property_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_property_notify_event_t>() , 20usize
               , concat ! (
               "Size of: " , stringify ! ( xcb_property_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_property_notify_event_t>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( xcb_property_notify_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_property_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_property_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_property_notify_event_t ) ) . pad0 as
                * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_property_notify_event_t ) , "::" , stringify ! ( pad0 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_property_notify_event_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_property_notify_event_t ) , "::" , stringify ! ( sequence
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_property_notify_event_t ) ) . window
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_property_notify_event_t ) , "::" , stringify ! ( window )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_property_notify_event_t ) ) . atom as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_property_notify_event_t ) , "::" , stringify ! ( atom )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_property_notify_event_t ) ) . time as
                * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_property_notify_event_t ) , "::" , stringify ! ( time )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_property_notify_event_t ) ) . state
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_property_notify_event_t ) , "::" , stringify ! ( state )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_property_notify_event_t ) ) . pad1 as
                * const _ as usize } , 17usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_property_notify_event_t ) , "::" , stringify ! ( pad1 )
                ));
}
impl Clone for xcb_property_notify_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_selection_clear_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_selection_clear_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub time: xcb_timestamp_t,
    /**<  */
    pub owner: xcb_window_t,
    /**<  */
    pub selection: xcb_atom_t,
}
#[test]
fn bindgen_test_layout_xcb_selection_clear_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_selection_clear_event_t>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( xcb_selection_clear_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_selection_clear_event_t>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( xcb_selection_clear_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_clear_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_clear_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_clear_event_t ) ) . pad0 as
                * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_clear_event_t ) , "::" , stringify ! ( pad0 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_clear_event_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_clear_event_t ) , "::" , stringify ! ( sequence
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_clear_event_t ) ) . time as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_clear_event_t ) , "::" , stringify ! ( time )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_clear_event_t ) ) . owner
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_clear_event_t ) , "::" , stringify ! ( owner )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_clear_event_t ) ) .
                selection as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_clear_event_t ) , "::" , stringify ! ( selection
                ) ));
}
impl Clone for xcb_selection_clear_event_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_time_t { XCB_TIME_CURRENT_TIME = 0, }
pub const xcb_atom_enum_t_XCB_ATOM_ANY: xcb_atom_enum_t =
    xcb_atom_enum_t::XCB_ATOM_NONE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_atom_enum_t {
    XCB_ATOM_NONE = 0,
    XCB_ATOM_PRIMARY = 1,
    XCB_ATOM_SECONDARY = 2,
    XCB_ATOM_ARC = 3,
    XCB_ATOM_ATOM = 4,
    XCB_ATOM_BITMAP = 5,
    XCB_ATOM_CARDINAL = 6,
    XCB_ATOM_COLORMAP = 7,
    XCB_ATOM_CURSOR = 8,
    XCB_ATOM_CUT_BUFFER0 = 9,
    XCB_ATOM_CUT_BUFFER1 = 10,
    XCB_ATOM_CUT_BUFFER2 = 11,
    XCB_ATOM_CUT_BUFFER3 = 12,
    XCB_ATOM_CUT_BUFFER4 = 13,
    XCB_ATOM_CUT_BUFFER5 = 14,
    XCB_ATOM_CUT_BUFFER6 = 15,
    XCB_ATOM_CUT_BUFFER7 = 16,
    XCB_ATOM_DRAWABLE = 17,
    XCB_ATOM_FONT = 18,
    XCB_ATOM_INTEGER = 19,
    XCB_ATOM_PIXMAP = 20,
    XCB_ATOM_POINT = 21,
    XCB_ATOM_RECTANGLE = 22,
    XCB_ATOM_RESOURCE_MANAGER = 23,
    XCB_ATOM_RGB_COLOR_MAP = 24,
    XCB_ATOM_RGB_BEST_MAP = 25,
    XCB_ATOM_RGB_BLUE_MAP = 26,
    XCB_ATOM_RGB_DEFAULT_MAP = 27,
    XCB_ATOM_RGB_GRAY_MAP = 28,
    XCB_ATOM_RGB_GREEN_MAP = 29,
    XCB_ATOM_RGB_RED_MAP = 30,
    XCB_ATOM_STRING = 31,
    XCB_ATOM_VISUALID = 32,
    XCB_ATOM_WINDOW = 33,
    XCB_ATOM_WM_COMMAND = 34,
    XCB_ATOM_WM_HINTS = 35,
    XCB_ATOM_WM_CLIENT_MACHINE = 36,
    XCB_ATOM_WM_ICON_NAME = 37,
    XCB_ATOM_WM_ICON_SIZE = 38,
    XCB_ATOM_WM_NAME = 39,
    XCB_ATOM_WM_NORMAL_HINTS = 40,
    XCB_ATOM_WM_SIZE_HINTS = 41,
    XCB_ATOM_WM_ZOOM_HINTS = 42,
    XCB_ATOM_MIN_SPACE = 43,
    XCB_ATOM_NORM_SPACE = 44,
    XCB_ATOM_MAX_SPACE = 45,
    XCB_ATOM_END_SPACE = 46,
    XCB_ATOM_SUPERSCRIPT_X = 47,
    XCB_ATOM_SUPERSCRIPT_Y = 48,
    XCB_ATOM_SUBSCRIPT_X = 49,
    XCB_ATOM_SUBSCRIPT_Y = 50,
    XCB_ATOM_UNDERLINE_POSITION = 51,
    XCB_ATOM_UNDERLINE_THICKNESS = 52,
    XCB_ATOM_STRIKEOUT_ASCENT = 53,
    XCB_ATOM_STRIKEOUT_DESCENT = 54,
    XCB_ATOM_ITALIC_ANGLE = 55,
    XCB_ATOM_X_HEIGHT = 56,
    XCB_ATOM_QUAD_WIDTH = 57,
    XCB_ATOM_WEIGHT = 58,
    XCB_ATOM_POINT_SIZE = 59,
    XCB_ATOM_RESOLUTION = 60,
    XCB_ATOM_COPYRIGHT = 61,
    XCB_ATOM_NOTICE = 62,
    XCB_ATOM_FONT_NAME = 63,
    XCB_ATOM_FAMILY_NAME = 64,
    XCB_ATOM_FULL_NAME = 65,
    XCB_ATOM_CAP_HEIGHT = 66,
    XCB_ATOM_WM_CLASS = 67,
    XCB_ATOM_WM_TRANSIENT_FOR = 68,
}
/**
 * @brief xcb_selection_request_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_selection_request_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub time: xcb_timestamp_t,
    /**<  */
    pub owner: xcb_window_t,
    /**<  */
    pub requestor: xcb_window_t,
    /**<  */
    pub selection: xcb_atom_t,
    /**<  */
    pub target: xcb_atom_t,
    /**<  */
    pub property: xcb_atom_t,
}
#[test]
fn bindgen_test_layout_xcb_selection_request_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_selection_request_event_t>() ,
               28usize , concat ! (
               "Size of: " , stringify ! ( xcb_selection_request_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_selection_request_event_t>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( xcb_selection_request_event_t
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_request_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_request_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_request_event_t ) ) . pad0
                as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_request_event_t ) , "::" , stringify ! ( pad0 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_request_event_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_request_event_t ) , "::" , stringify ! (
                sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_request_event_t ) ) . time
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_request_event_t ) , "::" , stringify ! ( time )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_request_event_t ) ) . owner
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_request_event_t ) , "::" , stringify ! ( owner )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_request_event_t ) ) .
                requestor as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_request_event_t ) , "::" , stringify ! (
                requestor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_request_event_t ) ) .
                selection as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_request_event_t ) , "::" , stringify ! (
                selection ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_request_event_t ) ) .
                target as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_request_event_t ) , "::" , stringify ! ( target
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_request_event_t ) ) .
                property as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_request_event_t ) , "::" , stringify ! (
                property ) ));
}
impl Clone for xcb_selection_request_event_t {
    fn clone(&self) -> Self { *self }
}
/**
 * @brief xcb_selection_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_selection_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub time: xcb_timestamp_t,
    /**<  */
    pub requestor: xcb_window_t,
    /**<  */
    pub selection: xcb_atom_t,
    /**<  */
    pub target: xcb_atom_t,
    /**<  */
    pub property: xcb_atom_t,
}
#[test]
fn bindgen_test_layout_xcb_selection_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_selection_notify_event_t>() , 24usize
               , concat ! (
               "Size of: " , stringify ! ( xcb_selection_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_selection_notify_event_t>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( xcb_selection_notify_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_notify_event_t ) ) . pad0
                as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_notify_event_t ) , "::" , stringify ! ( pad0 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_notify_event_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_notify_event_t ) , "::" , stringify ! ( sequence
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_notify_event_t ) ) . time
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_notify_event_t ) , "::" , stringify ! ( time )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_notify_event_t ) ) .
                requestor as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_notify_event_t ) , "::" , stringify ! (
                requestor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_notify_event_t ) ) .
                selection as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_notify_event_t ) , "::" , stringify ! (
                selection ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_notify_event_t ) ) . target
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_notify_event_t ) , "::" , stringify ! ( target )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_selection_notify_event_t ) ) .
                property as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_selection_notify_event_t ) , "::" , stringify ! ( property
                ) ));
}
impl Clone for xcb_selection_notify_event_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_colormap_state_t {
    XCB_COLORMAP_STATE_UNINSTALLED = 0,
    XCB_COLORMAP_STATE_INSTALLED = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum xcb_colormap_enum_t { XCB_COLORMAP_NONE = 0, }
/**
 * @brief xcb_colormap_notify_event_t
 **/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xcb_colormap_notify_event_t {
    /**<  */
    pub response_type: u8,
    /**<  */
    pub pad0: u8,
    /**<  */
    pub sequence: u16,
    /**<  */
    pub window: xcb_window_t,
    /**<  */
    pub colormap: xcb_colormap_t,
    /**<  */
    pub _new: u8,
    /**<  */
    pub state: u8,
    /**<  */
    pub pad1: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_xcb_colormap_notify_event_t() {
    assert_eq!(::std::mem::size_of::<xcb_colormap_notify_event_t>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( xcb_colormap_notify_event_t ) ));
    assert_eq! (::std::mem::align_of::<xcb_colormap_notify_event_t>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( xcb_colormap_notify_event_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_colormap_notify_event_t ) ) .
                response_type as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_colormap_notify_event_t ) , "::" , stringify ! (
                response_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_colormap_notify_event_t ) ) . pad0 as
                * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_colormap_notify_event_t ) , "::" , stringify ! ( pad0 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_colormap_notify_event_t ) ) .
                sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_colormap_notify_event_t ) , "::" , stringify ! ( sequence
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_colormap_notify_event_t ) ) . window
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_colormap_notify_event_t ) , "::" , stringify ! ( window )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_colormap_notify_event_t ) ) .
                colormap as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_colormap_notify_event_t ) , "::" , stringify ! ( colormap
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xcb_colormap_notify_event_t ) ) . _new as
                * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                xcb_colormap_notify_event_t ) , "::" , stringify ! ( _new )
                ));
    assert_eq! (unsafe {
